(function(){
	
if(!window['VRCHART']){ window['VRCHART'] = {}; }
if(VRCHART.Panel$map$){ return; }

//地图应用
VRCHART.Panel$map$ = {
	apps: [],
	show: function(container, data, dataindex){
		if(arguments.length < 2){ return; }
		var container = arguments[0];
		var data = arguments[1];
		var dataindex = isNaN(parseInt(arguments[2]), 10) ?  0 : Math.abs(parseInt(arguments[2]));
		container = typeof(container)=='string' ? document.getElementById(container) : container;
		if(!container || !data){ return; }
		this.areacode_format = this.areacode_format ? this.areacode_format : this.formatCode(this.areacode);
		this.mapcode_format = this.mapcode_format ? this.mapcode_format : this.formatCode(this.mapcode);
		this.detroyByContainer(container);
		return this.add(new Panel$map$app(container, data, dataindex))
	},
	detroyByContainer: function(container){
		for(var i=0; i<this.apps.length; i++){
			var app = this.apps[i];
			if(app.container == container){
				app.clear();
				this.apps.splice(i, 1);
				break;	
			}	
		}
	},
	add: function(app){
		this.apps.push(app);
		return app;
	},
	areacode_format: null,
	areacode: '000000-其它未知;0-其它未知;999001-日本;900000-美国;990000-国内未知;370100-山东省/济南市;520000-贵州省;520100-贵州省/贵阳市;360100-江西省/南昌市;360000-江西省;360700-江西省/赣州市;360400-江西省/九江市;500000-重庆市;152200-内蒙古自治区/兴安盟;150000-内蒙古自治区;150600-内蒙古自治区/鄂尔多斯市;150800-内蒙古自治区/巴彦淖尔市;150300-内蒙古自治区/乌海市;150900-内蒙古自治区/乌兰察布市;152500-内蒙古自治区/锡林郭勒盟;150100-内蒙古自治区/呼和浩特市;150400-内蒙古自治区/赤峰市;150500-内蒙古自治区/通辽市;150200-内蒙古自治区/包头市;150700-内蒙古自治区/呼伦贝尔市;420100-湖北省/武汉市;420000-湖北省;420600-湖北省/襄樊市;420200-湖北省/黄石市;421000-湖北省/荆州市;420300-湖北省/十堰市;421200-湖北省/咸宁市;420500-湖北省/宜昌市;430100-湖南省/长沙市;430000-湖南省;430600-湖南省/岳阳市;430400-湖南省/衡阳市;430200-湖南省/株洲市;430300-湖南省/湘潭市;220000-吉林省;350100-福建省/福州市;350300-福建省/莆田市;350000-福建省;350400-福建省/三明市;350800-福建省/龙岩市;350200-福建省/厦门市;350500-福建省/泉州市;350600-福建省/漳州市;310000-上海市;110000-北京市;433100-湖南省/湘西土家族苗族自治州;421300-湖北省/随州市;421100-湖北省/黄冈市;420900-湖北省/孝感市;420800-湖北省/荆门市;422800-湖北省/恩施土家族苗族自治州;429000-湖北省;371300-山东省/临沂市;370700-山东省/潍坊市;370300-山东省/淄博市;370500-山东省/东营市;371500-山东省/聊城市;370000-山东省;370400-山东省/枣庄市;450200-广西壮族自治区/柳州市;450000-广西壮族自治区;450100-广西壮族自治区/南宁市;451100-广西壮族自治区/贺州市;440300-广东省/深圳市;440000-广东省;440100-广东省/广州市;510100-四川省/成都市;510700-四川省/绵阳市;511000-四川省/内江市;510500-四川省/泸州市;510600-四川省/德阳市;510800-四川省/广元市;511100-四川省/乐山市;511300-四川省/南充市;510900-四川省/遂宁市;512000-四川省/资阳市;510300-四川省/自贡市;511500-四川省/宜宾市;510400-四川省/攀枝花市;511700-四川省/达州市;511800-四川省/雅安市;511600-四川省/广安市;510000-四川省;530100-云南省/昆明市;532900-云南省/大理白族自治州;532300-云南省/楚雄彝族自治州;530400-云南省/玉溪市;450300-广西壮族自治区/桂林市;340000-安徽省;320100-江苏省/南京市;320500-江苏省/苏州市;320200-江苏省/无锡市;450500-广西壮族自治区/北海市;450700-广西壮族自治区/钦州市;450600-广西壮族自治区/防城港市;451000-广西壮族自治区/百色市;450800-广西壮族自治区/贵港市;450900-广西壮族自治区/玉林市;450400-广西壮族自治区/梧州市;360200-江西省/景德镇市;360300-江西省/萍乡市;630100-青海省/西宁市;620000-甘肃省;620700-甘肃省/张掖市;620800-甘肃省/平凉市;621000-甘肃省/庆阳市;130600-河北省/保定市;130100-河北省/石家庄市;131100-河北省/衡水市;130700-河北省/张家口市;130800-河北省/承德市;131000-河北省/廊坊市;710000-台湾省;330100-浙江省/杭州市;810000-香港特别行政区;230100-黑龙江省/哈尔滨市;210100-辽宁省/沈阳市;120000-天津市;640100-宁夏回族自治区/银川市;320000-江苏省;320300-江苏省/徐州市;320600-江苏省/南通市;321200-江苏省/泰州市;320700-江苏省/连云港市;320400-江苏省/常州市;321100-江苏省/镇江市;321000-江苏省/扬州市;320900-江苏省/盐城市;220100-吉林省/长春市;441900-广东省/东莞市;440600-广东省/佛山市;445300-广东省/云浮市;440700-广东省/江门市;441300-广东省/惠州市;440400-广东省/珠海市;445200-广东省/揭阳市;441600-广东省/河源市;441400-广东省/梅州市;441800-广东省/清远市;440200-广东省/韶关市;442000-广东省/中山市;441200-广东省/肇庆市;441700-广东省/阳江市;440900-广东省/茂名市;440800-广东省/湛江市;440500-广东省/汕头市;441500-广东省/汕尾市;445100-广东省/潮州市;210200-辽宁省/大连市;210300-辽宁省/鞍山市;211300-辽宁省/朝阳市;210700-辽宁省/锦州市;211200-辽宁省/铁岭市;211100-辽宁省/盘锦市;210600-辽宁省/丹东市;210500-辽宁省/本溪市;210800-辽宁省/营口市;210400-辽宁省/抚顺市;210900-辽宁省/阜新市;211000-辽宁省/辽阳市;211400-辽宁省/葫芦岛市;210000-辽宁省;140000-山西省;140200-山西省/大同市;140400-山西省/长治市;140900-山西省/忻州市;140100-山西省/太原市;141000-山西省/临汾市;140700-山西省/晋中市;140800-山西省/运城市;140500-山西省/晋城市;140600-山西省/朔州市;140300-山西省/阳泉市;141100-山西省/吕梁市;460000-海南省;469000-海南省;460200-海南省/三亚市;460100-海南省/海口市;361100-江西省/上饶市;361000-江西省/抚州市;350900-福建省/宁德市;350700-福建省/南平市;360900-江西省/宜春市;411300-河南省/南阳市;410700-河南省/新乡市;410100-河南省/郑州市;410000-河南省;410200-河南省/开封市;410800-河南省/焦作市;410400-河南省/平顶山市;411400-河南省/商丘市;411000-河南省/许昌市;431100-湖南省/永州市;220200-吉林省/吉林市;610100-陕西省/西安市;610000-陕西省;511900-四川省/巴中市;430900-湖南省/益阳市;130200-河北省/唐山市;130400-河北省/邯郸市;130500-河北省/邢台市;130300-河北省/秦皇岛市;130000-河北省;230700-黑龙江省/伊春市;232700-黑龙江省/大兴安岭地区;231100-黑龙江省/黑河市;230400-黑龙江省/鹤岗市;230000-黑龙江省;230900-黑龙江省/七台河市;330200-浙江省/宁波市;330300-浙江省/温州市;330700-浙江省/金华市;331000-浙江省/台州市;330600-浙江省/绍兴市;330400-浙江省/嘉兴市;330500-浙江省/湖州市;330800-浙江省/衢州市;331100-浙江省/丽水市;330900-浙江省/舟山市;330000-浙江省;620100-甘肃省/兰州市;650100-新疆维吾尔自治区/乌鲁木齐市;659000-新疆维吾尔自治区;652100-新疆维吾尔自治区/吐鲁番地区;650000-新疆维吾尔自治区;652300-新疆维吾尔自治区/昌吉回族自治州;652800-新疆维吾尔自治区/巴音郭楞蒙古自治州;654000-新疆维吾尔自治区/伊犁哈萨克自治州;652700-新疆维吾尔自治区/博尔塔拉蒙古自治州;650200-新疆维吾尔自治区/克拉玛依市;230200-黑龙江省/齐齐哈尔市;230800-黑龙江省/佳木斯市;231200-黑龙江省/绥化市;152900-内蒙古自治区/阿拉善盟;530600-云南省/昭通市;530000-云南省;532600-云南省/文山壮族苗族自治州;532500-云南省/红河哈尼族彝族自治州;530300-云南省/曲靖市;530900-云南省/临沧市;530700-云南省/丽江市;620400-甘肃省/白银市;620500-甘肃省/天水市;620600-甘肃省/武威市;620300-甘肃省/金昌市;620900-甘肃省/酒泉市;621200-甘肃省/陇南市;621100-甘肃省/定西市;622900-甘肃省/临夏回族自治州;620200-甘肃省/嘉峪关市;340100-安徽省/合肥市;340200-安徽省/芜湖市;340300-安徽省/蚌埠市;340400-安徽省/淮南市;340500-安徽省/马鞍山市;340800-安徽省/安庆市;341300-安徽省/宿州市;341200-安徽省/阜阳市;341000-安徽省/黄山市;341100-安徽省/滁州市;340600-安徽省/淮北市;341800-安徽省/宣城市;341500-安徽省/六安市;341400-安徽省/巢湖市;341700-安徽省/池州市;360500-江西省/新余市;360800-江西省/吉安市;370200-山东省/青岛市;371400-山东省/德州市;370800-山东省/济宁市;370600-山东省/烟台市;371000-山东省/威海市;370900-山东省/泰安市;371600-山东省/滨州市;371200-山东省/莱芜市;230600-黑龙江省/大庆市;230300-黑龙江省/鸡西市;230500-黑龙江省/双鸭山市;411700-河南省/驻马店市;410600-河南省/鹤壁市;411500-河南省/信阳市;411600-河南省/周口市;410500-河南省/安阳市;410300-河南省/洛阳市;411100-河南省/漯河市;410900-河南省/濮阳市;411200-河南省/三门峡市;130900-河北省/沧州市;652900-新疆维吾尔自治区/阿克苏地区;360600-江西省/鹰潭市;321300-江苏省/宿迁市;320800-江苏省/淮安市;341600-安徽省/亳州市;371100-山东省/日照市;340700-安徽省/铜陵市;640300-宁夏回族自治区/吴忠市;632800-青海省/海西蒙古族藏族自治州;632100-青海省/海东地区;632200-青海省/海北藏族自治州;630000-青海省;632300-青海省/黄南藏族自治州;610300-陕西省/宝鸡市;610400-陕西省/咸阳市;610700-陕西省/汉中市;610500-陕西省/渭南市;610900-陕西省/安康市;611000-陕西省/商洛市;610200-陕西省/铜川市;610600-陕西省/延安市;610800-陕西省/榆林市;420700-湖北省/鄂州市;430700-湖南省/常德市;430500-湖南省/邵阳市;431200-湖南省/怀化市;431300-湖南省/娄底市;431000-湖南省/郴州市;430800-湖南省/张家界市;231000-黑龙江省/牡丹江市;222400-吉林省/延边朝鲜族自治州;220300-吉林省/四平市;220500-吉林省/通化市;220600-吉林省/白山市;220400-吉林省/辽源市;220700-吉林省/松原市;220800-吉林省/白城市;513400-四川省/凉山彝族自治州;511400-四川省/眉山市;451200-广西壮族自治区/河池市;371700-山东省/荷泽市;513300-四川省/甘孜藏族自治州;513200-四川省/阿坝藏族羌族自治州;520300-贵州省/遵义市;522700-贵州省/黔南布依族苗族自治州;522200-贵州省/铜仁地区;520200-贵州省/六盘水市;522300-贵州省/黔西南布依族苗族自治州;520400-贵州省/安顺市;522600-贵州省/黔东南苗族侗族自治州;522400-贵州省/毕节地区;533300-云南省/怒江傈僳族自治州;530800-云南省/思茅市;532800-云南省/西双版纳傣族自治州;530500-云南省/保山市;533100-云南省/德宏傣族景颇族自治州;652200-新疆维吾尔自治区/哈密地区;653100-新疆维吾尔自治区/喀什地区;654200-新疆维吾尔自治区/塔城地区;640200-宁夏回族自治区/石嘴山市;640400-宁夏回族自治区/固原市;632500-青海省/海南藏族自治州;640000-宁夏回族自治区;820000-澳门特别行政区;653000-新疆维吾尔自治区/克孜勒苏柯尔克孜自治州;540100-西藏自治区/拉萨市;542300-西藏自治区/日喀则地区;542100-西藏自治区/昌都地区;542600-西藏自治区/林芝地区;542400-西藏自治区/那曲地区;542200-西藏自治区/山南地区;542500-西藏自治区/阿里地区;640500-宁夏回族自治区/中卫市;654300-新疆维吾尔自治区/阿勒泰地区;623000-甘肃省/甘南藏族自治州;451300-广西壮族自治区/来宾市;653200-新疆维吾尔自治区/和田地区;533400-云南省/迪庆藏族自治州;451400-广西壮族自治区/崇左市;540000-西藏自治区',
	mapcode_format: null,
	mapcode: '110000-北京市;120000-天津市;130000-河北省;140000-山西省;150000-内蒙古自治区;210000-辽宁省;220000-吉林省;230000-黑龙江省;310000-上海市;320000-江苏省;330000-浙江省;340000-安徽省;350000-福建省;360000-江西省;370000-山东省;410000-河南省;420000-湖北省;430000-湖南省;440000-广东省;450000-广西壮族自治区;460000-海南省;469000-海南省;500000-重庆市;510000-四川省;520000-贵州省;540000-西藏自治区;530000-云南省;610000-陕西省;620000-甘肃省;630000-青海省;640000-宁夏回族自治区;659000-新疆维吾尔自治区;710000-台湾省',
	formatCode: function(codestring){
		var format = {};
		var codes = codestring.split(';');
		for(var i=0, len=codes.length; i<len; i++){
			var d = codes[i];
			var d = d.split('-');
			var code = d[0];
			var v = d[1];
			var p = '';
			var c = '';
			if(v.indexOf('/') != -1){ 
				v = v.split('/'); 
				p = v[0];
				c = v[1];	
			}	
			else{ p = v; }
			format[code] = c ? c : p;	
		}
		return format;
	}
}

var Panel$map$app = function(container, data, dataindex){
	this.container = container;
	this.data = data;
	this.dataindex = dataindex;
	this.control = null;
	this.map = null;
	this.init();
}

Panel$map$app.prototype = {
	config: {
		maxlen : 3,
		levels	: [
			{'color': '#2b64b4', 'max': 3},
			{'color': '#3d82cb', 'max': 6},
			{'color': '#5da5df', 'max': 9},
			{'color': '#78bce8', 'max': 12},
			{'color': '#99cbef', 'max': 15},
			{'color': '#b4dbf3', 'max': 1000}
		]
	},
	
	init: function(){
		try{ 
			this.data = (typeof(this.data) == 'string') ? eval('('+ this.data +')') : this.data; 
		}catch(e){ 
			return this.showError('数据错误'); 
		}
		if(!this.data.length && typeof(this.data.splice) != 'function'){ return this.showError('数据错误'); }
		if(this.data.length>this.config.maxlen){ this.data.splice(this.config.maxlen-1, this.data.length-this.config.maxlen); }
		if(!this.data || !this.data.length){ return this.showError('暂无数据'); }
		if(!this.data[this.dataindex]){ return this.showError('此索引项不存在'); }
		
		var data = this.data[this.dataindex];
		
		var empty = true;
		for(var key in data){
			if(typeof(data[key]) == 'object'){
				if(data[key].length){ empty=false; break; }
			}	
		}
		if(empty){ return this.container.innerHTML = '<div style="color:#909090;font-size:12px;text-align:center;padding:150px 0;">此项暂无数据</div>'; }
		
		this.data = this.convertData(data);

		this.draw();
	},
	
	showError: function(msg){
		this.container.innerHTML = '<div class="charterror">'+ msg + '</div>';
		return this;
	},
	
	draw: function(){
		this.clear();
		var data = this.data;
		this.control = document.createElement('div');
		this.control.className = 'chartmap';
		var box = document.createElement('div');
		box.className = 'mapg';
		
		this.control.appendChild(box);
		this.container.appendChild(this.control);
		//level
		this.drawLevelinfo();
		//省份/城市
		this.drawpcinfo();
		//map VML 效率低置后
		this.map = new Map(box, null, data.provinceMap);
		
		return this;
	},
	
	drawpcinfo: function(){
		var areastat = document.createElement('div'); areastat.className = 'area';
		var changer = document.createElement('ul'); changer.className = 'choice';
		var c1 = document.createElement('li');
		var c2 = document.createElement('li'); c2.className = 'current';
		c1.innerHTML = '<span>省份</span>';
		c2.innerHTML = '<span>城市</span>';
		var current = 2;
		
		changer.appendChild(c1);
		changer.appendChild(c2);
		areastat.appendChild(changer);
		
		var queue1 = document.createElement('ul'); queue1.className = 'queue'; queue1.style.display = 'none';
		var queue2 = document.createElement('ul'); queue2.className = 'queue'; 
		var drawqueue = function(data, dom){
			var len = data.length > 10 ? 10 : data.length;
			for(var i=0; i<len; i++){
				var d = data[i];
				var classname = (i+1)%2 == 0 ? '' : 'odd';
				var li = document.createElement('li');
				if(classname){ li.className = classname; }
				var percent = (d.value/data[0].value)*100;
				li.innerHTML = '<span class="statsn">'+ (i+1) +'</span><span class="statname">'+ convertAreaName(d.name) +'</span><span class="statbar"><span class="bar" style="width:'+ percent +'%"></span></span>'	
				dom.appendChild(li);
			}
		}
		
		drawqueue(this.data.province, queue1);
		drawqueue(this.data.city, queue2);
		
		areastat.appendChild(queue1);
		areastat.appendChild(queue2);
		
		c1.onclick = function(){ if(current != 1){ c1.className = 'current'; c2.className = ''; queue1.style.display ='block'; queue2.style.display='none'; current=1; } }
		c2.onclick = function(){ if(current != 2){ c2.className = 'current'; c1.className = ''; queue2.style.display ='block'; queue1.style.display='none'; current=2; } }
		
		this.control.appendChild(areastat);
		
		return this;
	},

	drawLevelinfo: function(){
		var levelinfo = document.createElement('div');
		var l1 = document.createElement('label');
		l1.innerHTML = '高';
		levelinfo.className = 'mapi';
		var ul = document.createElement('ul');
		for(var i=0, len=this.config.levels.length; i<len; i++){
			var color = this.config.levels[i].color;
			var li = document.createElement('li');
			li.style.backgroundColor = color;
			ul.appendChild(li);	
		}
		var l2 = document.createElement('label');
		l2.innerHTML = '低';
		
		levelinfo.appendChild(l1);
		levelinfo.appendChild(ul);
		levelinfo.appendChild(l2);
		
		this.control.appendChild(levelinfo);
		return this;
	},

	getAreaByName: function(name){
		for(var i=0, len=this.map.areas.length; i<len; i++){
			var area = this.map.areas[i];
			if(area.name == name){
				return area;
			}
		}
		return null;
	},
	
	getNameByCode: function(code){
		var name = VRCHART.Panel$map$.areacode_format[code];
		return name ? name : '未知地区';
	},
	
	getColorByPlace: function(place){
		var len = len=this.config.levels.length;
		var color = this.config.levels[len-1].color;
		for(var i=0; i<len; i++){
			var level = this.config.levels[i];
			var max = level.max;
			if(place <= max){
				color = level.color;
				break;
			}
		}
		return color;
	},
	
	//对现有数据编码接名称重格式并排序
	_convert: function(data){
		var queue = [];
		for(var i=0, len=data.length; i<len; i++){
			var d = data[i].split(':');
			if(d.length == 1){ d[1] = 0; }
			var code = d[0];
			var name = this.getNameByCode(d[0]);
			var value = parseInt(d[1], 10);
			queue[i] = {"name": name, "value": value, "code": code};
		}
		return this._quickSort(queue, 'value');
	},
	
	_quickSort: function(data, by){
		var i = 0;
		var j = data.length-1;
		var qSort = function(i, j){
			if( i == j ){ return }// 当前组仅有一个元素则结束
			var ai = data[i];//取出的主元
			var ii = i;//记录i的开始位置
			var jj = j;//记录J的开始位置
			while( i < j ){
				if( data[j][by] >= ai[by]){ j--; }
				else{                       
					data[i] = data[j];
					i++;
					while( i < j){
						if(data[i][by] > ai[by]){
							data[j] = data[i];
							break;
						}else{
							i++;
						}
					}
				}
			}
			if( ii == i){
				qSort(++i, jj);
				return ;
			}
			data[i] = ai;
			qSort(ii, i);//第一组排序
			qSort(j, jj);//第二组排序
		}
		qSort(i,j);
		return data.reverse();
	},
	
	convertData: function(data){
		
		var rs = {};

		for(var key in data){
			rs[key] = data[key];
			if(rs[key].length && typeof(rs[key].splice) == 'function'){
				rs[key] = this._convert(rs[key]);
			}
		}
		//补全缺失地图统计信息删除无效信息
		if(rs.provinceMap){
			//删除无效
			var flag = false;
			while(!flag){
				for(var i=0; i<rs.provinceMap.length; i++){
					var d = rs.provinceMap[i];
					if(!VRCHART.Panel$map$.mapcode_format[d.code]){
						rs.provinceMap.splice(i, 1);
					}
				}
				flag = true;
				for(var i=0; i<rs.provinceMap.length; i++){
					var d = rs.provinceMap[i];
					if(!VRCHART.Panel$map$.mapcode_format[d.code]){
						flag = false; break;
					}
				}
			}
			//增加缺失
			for(var key in VRCHART.Panel$map$.mapcode_format){
				var d = VRCHART.Panel$map$.mapcode_format[key];
				var flag = false;
				for(var j=0; j<rs.provinceMap.length; j++){
					var d1 = rs.provinceMap[j];
					if(d1.code == key){
						flag = true;
						break;	
					}
				}
				if(!flag){ rs.provinceMap.push({"name": d, "value": 0, "code": key}) }
				//增加 位次颜色信息
				for(var j=0; j<rs.provinceMap.length; j++){
					rs.provinceMap[j].color = this.getColorByPlace(j+1);
					rs.provinceMap[j].place = j +1;
				}
			}
		}
		return rs;
	},

	clear: function(){
		if(this.map){ this.map.destroy(); }
		this.map = null;
		this.container.innerHTML = '';
		return this;
	}
	
} 

//地图
var Map = function(container, config, placedata){
	this.config = {
		size		: {width: 390, height: 290},
		stroke		: '#fff'
	}
	this.container 	= arguments[0];
	if(!this.container){ return; }
	this.config 	= typeof(arguments[1]) == 'object' 
	? mergeConfig(this.config, config)
	: this.config;
	this.placedata 	= typeof(arguments[2]) == 'object'
	? placedata
	: null 
	
			
	this.paper		= null;	
	this.areas		= [];
	this.tooltip 	= null;
	this.levelinfo = null;
	this.tiptimer = null;
	this.drawtimer = null;
	this.is_touchOS = ("createTouch" in document);
	this.currentarea = null; //for touch
	
	this.init();
}
Map.prototype = {
	init: function(){
		//合并附加数据
		if(this.placedata){
			for(var i=0, len=this.mapdata.length; i<len; i++){
				var d = this.mapdata[i];
				for(var j=0, len1=this.placedata.length; j<len1; j++){
					var d1 = this.placedata[j];
					if(d1.name == d.name){
						d.color = d1.color;
						d.place = d1.place;
						d.code = d1.code;
						d.value = d1.value;
						break;	
					}	
				}	
			}	
		}
		
		this.paper = Raphael(
			this.container,
			this.config.size.width,
			this.config.size.height
		);
		this.drawAreas()
		
	},
	
	destroy: function(){
		while(this.hasArea()){
			if(!this.areas[0].destroy()){ return false; };	
		}
		if(this.tooltip){
			this.tooltip.remove();
		}
		if(this.drawtimer){
			clearTimeout(this.drawtimer);	
			this.drawtimer = null;
		}
		this.paper.remove();
		this.paper = null;
		return true;
	},
	
	drawAreas: function(){
		//IE6 VML 绘制效率低异步绘制
		if(Raphael.vml){
			var _this =this;
			var index = 0;
			function add(index){
				if(index >= _this.mapdata.length){
					_this.drawTooltip()
					_this.drawtimer.timer = null;
					return false;	
				}else{
					_this.drawArea(index);		
					_this.drawtimer = setTimeout(function(){ 
						index ++; 
						add(index); 
					}, 25);
				}	
			}
			add(index);
		}else{
			var len = this.mapdata.length;
			for(var i=0; i<len; i++){
				this.drawArea(i);
			}
			this.drawTooltip()	
		}
		return this;
	},
	
	drawArea: function(index){
		var _this = this;
		var d = this.mapdata[index];
		var area = new Maparea(this, {
			'color'			: d.color ? d.color : '#ecf7fd',
			'path'			: d.path,
			'name'			: d.name,
			'stroke'		: this.config.stroke,
			'stroke-width'	: 0
		});
		if(d.place){
			area.place = d.place;	
		}

		
		var f_in = function(e){ 
			area.fade(); 
			clearTimeout(_this.tiptimer); _this.tiptimer = null; _this.showTip(area);
		}
		var f_out = function(){ 
			area.renew(); 
			_this.tiptimer = setTimeout(function(){ if(_this.tiptimer){ _this.hideTip(); clearTimeout(_this.tiptimer); } }, 200); 
		}
		var f_move = function(e){ 
			_this.moveTip(e); 
		}
		
		var f_touchstart = function(e){
			_this.posTip(e);
			if(_this.currentarea != area){
				_this.showTip(area);
				area.fade();
				if(_this.currentarea){ _this.currentarea.renew(); }
				_this.currentarea = area;
			}else{
				area.renew();
				_this.hideTip();
				_this.currentarea = null;
			}
		}
		
		if(this.is_touchOS){
			area.gp.touchstart(f_touchstart);
		}else{
			area.gp.hover(f_in, f_out).mousemove(f_move);
		}
		
		this.addArea(area);
	},

	drawTooltip: function(){
		this.tooltip = this.paper.set();
		this.tooltip_rect2 = this.paper.rect(4, 4, 80, 40).attr({'fill': '#000', 'fill-opacity': 0.4, 'stroke': '', 'stroke-width': 0});
		this.tooltip_rect = this.paper.rect(0, 0, 80, 40).attr({'fill': '#ffffcc', 'stroke': '', 'stroke-width': 0});
		this.tooltip_text_name = this.paper.text(10, 10, '').attr({'font-size': 13, 'text-anchor': 'start'});
		this.tooltip_text_place = this.paper.text(10, 30, '').attr({'font-size': 14, 'text-anchor': 'start', 'font-weight': 'bold'});
		this.tooltip.push(this.tooltip_rect, this.tooltip_rect2, this.tooltip_text_name, this.tooltip_text_place).hide();	
		return this;
	},

	showTip: function(area){
		if(!this.tooltip){ return this; }
		this.tooltip.show();
		this.tooltip_text_name.attr({'text': convertAreaName(area.name)});
		this.tooltip_text_place.attr({'text': '排名:' + area.place});	
		return this;	
	},

	hideTip: function(){
		if(!this.tooltip){ return this; }
		this.tooltip.hide();
		return this;
	},

	moveTip: function(e){
		if(!this.tooltip){ return this; }
		this.posTip(e);
		return this;
	},
	
	posTip: function(e){
		if(!this.tooltip){ return this; }
		var e = e || window.event;
		var x = 0;
		var y = 0;
		
		try{
			var posMap = this.getDOMPos(this.container);
			var posMouse = this.getMousePos(e);	
			x = posMouse.x - posMap.x;
			y = posMouse.y - posMap.y;	
		}catch(e){
			x = 0;
			y = 0;
		}
		if(x < 0){ x=0; } 
		if(y < 0){ y=0; }
		
		if(x + 90 > this.config.size.width){ x = x - 80 -10; }else{ x += 10; }
		if(y + 50 > this.config.size.height){ y = y - 40 -10; }else{ y += 10; }
		this.tooltip_rect.attr({'x': x, 'y': y});
		this.tooltip_rect2.attr({'x': x+4, 'y': y+4});
		this.tooltip_text_name.attr({'x': x + 10, 'y': y + 10});
		this.tooltip_text_place.attr({'x': x + 10, 'y': y + 30});
		
		return this;
	},

	getMousePos: function(e){
		if(e.pageX || e.pageY){ return {x:e.pageX, y:e.pageY}; }
		var body = document.documentElement ? document.documentElement : document.body;
		return {
			x:e.clientX + body.scrollLeft - body.clientLeft,
			y:e.clientY + body.scrollTop - body.clientTop
		};
	},

	getDOMPos: function(o){
		if (o.getBoundingClientRect) {
			var box = o.getBoundingClientRect();
			var D = document.documentElement;
			var x = box.left + Math.max(D.scrollLeft, document.body.scrollLeft) - D.clientLeft;
			var y = box.top + Math.max(D.scrollTop, document.body.scrollTop) - D.clientTop;
			return {'y': y, 'x': x};
		}else{
			function pageX(o){ try {return o.offsetParent ? o.offsetLeft +  pageX(o.offsetParent) : o.offsetLeft; } catch(e){ return 0; } }
			function pageY(o){ try {return o.offsetParent ? o.offsetTop + pageY(o.offsetParent) : o.offsetTop; } catch(e){ return 0; } }
			return {'y': pageY(o), 'x': pageX(o)};
		}
	},

	hasArea: function(){
		return this.areas.length && true;
	},

	addArea: function(area){
		this.areas.push(area);
		return this;
	},

	removeArea: function(area){
		if(area){ area.destroy(); }
		return this;
	},

	mapdata: [{"name":"\u5185\u8499\u53e4\u81ea\u6cbb\u533a","path":"M285.693,22.546l-0.565-1.778l-1.456-2.507l-1.213-0.647l-1.213,0.647l-0.727,1.455  l-0.082,0.162h-0.161h-0.081l-2.263,0.404c-0.244,0.161-0.486,0.242-0.648,0.485l-0.486,0.565l-1.213,0.971l-0.322,0.161  l-1.052,0.162c-0.485-0.081-1.213-0.485-2.183-1.213l-0.082-0.081c-1.617-1.617-2.426-2.749-2.426-3.396v-2.103v-0.081v-0.082  l0.244-0.404l-2.345-0.809l-0.081,0.809c0,0.243-0.244,0.566-0.647,0.809l-0.809,0.324l-0.323-0.081V16.24l-1.213-0.243  l0.243,0.889l-2.103-1.374h-0.082l-0.081-0.081l0,0c-0.324-0.889-0.485-1.779-0.485-2.749c0-0.809,0.081-1.293,0.404-1.617  l0.485-0.889l-0.161-0.728l-2.103,0.324c-1.052,0.081-1.779,0.728-2.184,1.94v0.081l0,0l-1.213,1.859l1.213-0.081h0.08l0.082-0.081  l0.081,0.161l0.969,0.405h0.163l0.161,0.081v0.242l0.162,1.698l0.486,1.617v0.082v0.081v0.081l-2.669,5.255  c-0.484,0.728-0.727,2.668-0.888,5.579v0.242l-1.052,2.022l0.728,0.809v0.162c0.081,1.213,0,1.94-0.323,2.102l-0.242,0.081  c-0.566,0.324-2.426,2.264-5.418,5.903l-0.242,0.242l-0.162-0.081l-0.242-0.161c-1.052-0.728-2.021-1.375-2.587-2.021  c-0.485-0.323-1.698-0.566-3.719-0.566l-0.081,3.72l-0.081,0.081l-1.456,7.034c-0.324,0.89-0.404,2.507-0.404,4.933l0.565,0.727  l0.486-0.97h0.081l0.081-0.162l1.86-0.97l5.174,0.809l0.567-0.647l0.727-1.294l0.161-0.08l0,0l0.081-0.081l2.021-0.404l2.669-0.162  c0.809,0.162,1.778,1.213,2.991,2.83c3.234,1.617,5.013,3.072,5.417,4.366c0.242,0.647,0.242,1.132,0,1.698  c-0.243,0.566-0.809,0.89-1.617,0.971h-0.082c-3.961-0.162-6.226-0.162-7.034,0.081l-1.94,1.293  c-2.426,1.779-4.043,2.669-4.933,2.669l-1.616,0.242l-0.97,4.043c-0.243,1.213-0.647,2.021-1.375,2.587  c-0.646,0.647-1.617,1.051-2.911,1.294c-1.537,0.243-2.83,0.809-4.042,1.536l-1.375,2.911l-0.082,0.081h-0.08h-0.081l-3.719,1.537  h-0.243l-1.859-0.404c-1.455-0.243-2.588-0.646-3.316-1.132c-0.969-0.485-2.021-0.565-3.152-0.242  c-0.971,1.375-1.456,3.072-1.375,4.932c0.081,0.97,0.324,1.617,0.566,1.778l0.566-0.08l0.647-0.404l0.162,2.587  c0,0.89-0.324,1.536-0.97,2.022c-0.404,0.323-1.132,0.646-2.184,0.97l-0.646,0.162c-0.809,0.324-2.507,2.507-5.013,6.468v0.082  h-0.081l-2.426,1.455c0.404,0,0.647,0.162,0.565,0.485c-0.081,0.324-0.323,0.404-0.97,0.486l-6.873-0.162  c-7.682-0.242-13.665,1.86-17.951,6.226l-0.081,0.082l-0.161,0.081h-0.08l-2.83,0.323l-0.163,0.081h-0.161l-0.809-1.94  l-2.911,0.728c-1.537,0.081-3.558-0.323-5.822-1.456c-2.102-0.889-3.962-2.102-5.822-3.558c-1.212-0.97-2.749-1.616-4.527-1.94  l-2.588-0.243l-2.911,0.404c-2.102,0.324-4.204,0.324-6.145,0.162c-2.345-0.162-5.175-0.809-8.57-1.86l-0.243,0.485h0.081h0.081  l0.082,0.08v0.082l0.081,0.809l0.728,1.536l1.698,2.102l0.081,0.243l-0.323,1.536v0.081h-0.081l-0.97,1.293l1.051,1.052  c0.404,0.404,0.647,0.728,0.647,1.051l0.242,1.536l1.213,1.213v0.162l0.162,1.051v0.809l0.729,0.566l0.484-0.162l0.081-0.242  c0.243-0.647,0.647-0.971,1.213-1.051l0.647-0.242l4.285-0.404l1.698-0.647l0.162-0.081l0.243-0.162l0.89,1.941h0.08l0,0  c0.081,0.485,0,0.889-0.242,1.293l-2.345,3.315l0.162,0.566l1.051,1.051l1.051,0.647h0.081c0.485,0.646,0.889,1.051,1.375,1.212  c0.565,0.162,1.131,0.647,1.617,1.293l0.081,0.243l0.809,0.323l0.243,0.081h0.081l0.242,0.889l0,0l0.081,0.889l0.323,1.293  l2.021,0.324h0.162l0.081,0.081v0.081l0.081,0.162l0.566,1.132l1.617,0.565l1.132-0.565l-0.162-0.647l-1.051-0.97l0.162-0.162  v-0.161l0.889-1.698h1.941l0.081,0.081l2.75,0.97l1.536-0.242l1.213-1.132c1.375-1.698,2.264-2.426,2.83-2.021l0.647-0.081  c0.728,0,1.132,0.081,1.375,0.161c0.081,0.162,0.162,0.324,0.162,0.486c0,0.323,0.324,0.97,0.809,1.859v0.081v0.081l0.242,1.132  v0.243l-0.323,1.294l0,0v0.081l-0.082,0.081l-1.375,1.617l-0.081,0.081l0,0l-2.91,1.294l-0.404,0.809l-0.404,2.345l0.242,1.132  l0.728,1.213l0.324,0.243l0.97,0.647h3.396l2.83-0.404l0.404-0.404c0.404-0.485,0.809-0.647,1.05-0.647l1.941,0.324l0.162-0.324  c-0.162-0.566-0.162-1.051,0.162-1.537l0.809-1.374v-2.587v-0.082l1.456-4.204l0.081-0.081v-0.082h0.081v-0.081l2.506-2.021  l0.162-0.161l2.183,0.97l0,0c1.132,0.809,1.697,1.456,1.697,1.86l-0.161,1.778l-0.728,1.133l-0.567,1.617v1.779l0.567,0.809  l0.728-0.082l0.161-0.081l1.213,0.081c0.647,0.324,1.052,0.89,1.375,1.698l0.728,0.243h0.082l0,0h0.081l2.749,1.293l1.213,0.404  l1.698-0.242l0.727-0.971l0.97-3.961l0.081-2.183v-0.162l0.162-0.081l0.082-0.081l1.536-1.293l0.89-1.132l0.081-0.081l1.617-0.728  l0.97-0.566l1.212-0.485l-0.646-2.426l2.748,0.324l0,0v0.081l0,0l1.456,0.566l0,0v-0.081l0.404-1.537v-0.242l0.244,0.081h0.161  l1.293,0.324h0.647l1.213-1.375h0.081l0.081-0.081h0.082l1.617-0.323l1.375-1.294l0.728-1.052v-1.293  c0-0.485,0.241-0.809,0.728-1.051l0,0h0.162h0.08l1.537,0.162l0.647-0.404l0.242-1.132l1.617-0.485h0.081h0.082l0,0l2.021,0.243  l1.617-0.404l0.97-0.971l0.647-1.293l-1.213-1.294v-0.081l0,0l-0.243-0.971l0,0l-0.324-1.456v-0.081l0.728-1.293  c0-0.404,0.243-0.97,0.889-1.617l0.889-1.779v-0.081h0.082l0.808-1.294l1.213-2.426l1.131,1.617l0.082,0.082v0.081l0.404,1.617  v0.081l0.242,1.617l1.132,0.485h0.081l0,0l0,0l0.324,0.161l0.081-0.081l0.971-1.698l0.566-1.617l0.243,0.081l0.242,0.082  l2.344,0.808l1.133-0.889l0.08-0.081h0.162l1.132-0.081l0.809-1.375v-1.699l0.566-2.587l0.161,0.081h0.243l1.778,0.404l0.809-1.456  h0.081h0.162l1.617-0.162h0.242v0.081l0.162,0.081l0.809,1.132v0.081l0.081,0.081v0.162l0.161,1.617l0.808,0.728l1.132-1.051  l0.243,0.324c0.404,0.404,0.565,0.809,0.565,1.293v1.456l-0.565,1.456l0.404,0.646l0.809,0.889l3.396,0.485l0.081,0.082l0,0  l0.162,0.081l0,0l0.242,0.242l0.971-1.374h0.081l0.809-0.809l-0.325-1.213l-0.888-5.175l2.345,1.132h0.082h0.079l1.052,1.293  l0.647,0.647l0.97-0.647l3.396-3.719l0,0h0.082l1.213-0.89l1.375-1.94l0.082-0.162l1.858,0.485h0.89  c0-0.728,0.161-1.213,0.243-1.537l1.374-1.617l0.404-0.243l1.617,0.566l1.941-0.243l1.293-1.374l0.647-1.213l-0.404-0.647  l-1.132,0.566l-0.081-0.082l-0.082-0.081l-1.455-1.293l-0.081-0.081l0.565-2.184l0.161-1.616l-0.404-1.375l-1.131-0.404v-0.081  l-0.082-0.081l-0.079-0.081l-0.971-1.94l-0.163-0.243l-1.374,1.617l-1.374,0.889l-0.324,0.162l-0.081-0.081l-0.082-0.162  l-1.455-1.375v-0.081l-1.05-2.264v-0.081l-0.486-1.617v-0.081l0,0v-2.426l-0.162-1.455l-1.132-0.404h-0.081v-0.081l-2.586-2.021  l0.161-0.243l1.213-1.293v-0.081v-0.081h0.161l0,0l1.374-0.161h0.082c0.404,0,0.809,0.242,1.131,0.647l1.134,0.889l1.212-0.971  l0.888-1.213v-1.051l-0.322-2.588l-0.243-1.05l-1.779-0.324v-1.051l-1.617-2.021l-0.082-0.082l-0.809-1.455l-0.161-0.163v-0.161  l0,0l1.778-2.345v-0.081l0.082-0.081v-0.081h0.162l0.728-0.081l0.89-0.728l1.051-3.234h0.081v-0.081l1.294-1.455v-0.081h0.082  h0.079l1.456-0.404v0.162l0.97,0.809l0.325,0.081l0.565-2.506l-0.565-1.779l-0.082-0.081v-0.162l0.243-2.021v-0.162l0.97-1.05  l0.647-1.132l0.081-0.97c0-0.485-0.242-1.293-0.728-2.506l0,0l0,0v-1.94v-0.082l0.404-1.698c-0.322-0.728-0.565-1.293-0.565-1.698  L285.693,22.546z"},{"name":"\u7518\u8083\u7701","path":"M171.444,121.029h-1.293l-0.404,0.889l0.728,0.728v0.081v0.081l0.324,1.051l0.08,0.081v0.243  l-0.162,0.081l-1.779,0.889l-0.081,0.082l0,0h-0.081h-0.082c-1.375-0.162-2.102-0.566-2.344-1.132l-0.486-0.971l-2.425-0.485  l-0.647-3.073c-0.485-0.081-0.889-0.323-1.132-0.646l-0.081-0.163c-0.404-0.565-0.728-0.889-1.213-0.97  c-0.647-0.242-1.213-0.728-1.697-1.455l-0.971-0.566h-0.081l0,0l0,0l-1.293-1.294l0,0l-0.324-1.132v-0.081l2.587-3.558  c0.082-0.243,0.162-0.404,0.082-0.485l-0.486-1.132l-1.375,0.566h-0.081v0.081h-0.081l-3.558,0.242l-1.375,0.324l-0.485,0.485  l-0.242,0.485c-0.324,0.404-0.809,0.647-1.537,0.485l0,0l-0.08-0.081l-1.213-0.89l-0.082-2.021  c-0.646-0.485-1.051-0.97-1.213-1.374l-0.323-1.779l-0.809-0.97l-0.89-0.728l-0.404-0.242l1.456-1.86l0.324-1.052l-1.617-2.021  h-0.081v-0.081l-0.728-1.617v-0.081l0,0l-0.162-0.809l-1.051-0.809v-0.081l0,0l0,0l-1.132-1.213l-1.456-0.243l-1.617,0.485  l-0.243,0.323l-0.242,2.265v2.506l-0.242,0.081l-1.537,0.566l0,0v0.081l0,0l-1.456,0.081c-0.728,0.404-1.536,0.809-2.426,1.132  l-0.162,0.081l0,0h-0.081l-2.75-0.647l-1.132,1.213c-0.243,0.324-0.809,0.647-1.536,0.809l-1.698,1.375l-0.889,1.374v0.082  l-0.081,0.081c-0.486,0.728-0.89,1.294-1.213,1.537l-0.971,1.213v0.081l-0.081,0.081l-0.566,0.404  c-0.404,0.161-0.809,0.243-1.132,0.243l-2.021-0.162l-0.484,0.728l-0.729,1.293l0.324,1.293l-0.162,3.154l0.566,0.97v0.081  l0.242,0.728h1.132l1.94,0.404l2.506,0.162l1.132-0.162h0.162h0.081l2.184,0.809l0,0h0.081l1.132,0.889l2.426,0.89h0.081  l1.617,0.97l3.962,3.639l1.779,0.809l0.728-0.323l0.728-1.375l-0.404-2.183c0-0.647,0.485-1.051,1.456-1.456l0.162-0.081  l4.932,2.911l0.566-0.162l1.132-0.647h0.162l0.646,0.081l0.971-0.809l0.161-0.081l0.243,0.161l2.91,2.022l0.081,0.081l1.86,1.536  c0.485,0.323,1.131,0.89,1.698,1.698l0.889,0.97l0.728-0.081l0.808-1.536l1.698,1.213h0.081h0.081l0,0l1.375,1.697l3.639,2.75l0,0  l1.051,1.213l3.154-0.889l0.162,2.345l1.374,1.375l0,0v0.08l1.132,1.699v0.081v0.081v0.081l1.213,5.579l1.213,2.264l-1.617,4.124  v0.242l-1.375,0.324v1.213l-0.081,0.081l-1.375,2.264h-0.162l-1.94,0.162l-1.941,1.617c0.242,0.243,0.566,0.404,1.132,0.647  c0.809,0.243,0.889,0.89,0.485,2.021v0.081l-1.375,1.375h-0.081l-0.081,0.161h-0.081h-0.081l-3.881-0.565l-0.081,1.374l0.404,2.911  l3.234,1.375v0.161l0,0l1.213-0.404l0.081-0.081l0.162-0.081l0.082,0.161h0.081l0.889,0.485h1.375l0.486-0.081l-0.486-1.536l0,0  l0,0l-0.323-1.617v-0.081v-0.161l0.08-0.082v-0.081l0.485-0.566l0.162-0.162l0,0l0.082-0.081l0.889-1.213l0.081-0.081l1.456-1.132  h0.081v-0.081h0.081l0,0l1.779-0.243v0.486c0,0.566,0.081,0.97,0.161,1.213l0.324,0.727l0.485,1.051l1.617,0.89l4.447,0.404h0.162  h0.243v0.243v0.162l-0.162,1.456l1.294,1.375l0.97,0.404l0.162,0.081v0.081l0.081,0.161v0.567v0.808l-0.404,1.617l0.565,0.404  c0.647-0.081,1.212-0.081,1.779,0.324l1.859,0.889l1.132-0.889l1.213-1.294l0.081-0.565l0.081-0.162l0.163-0.082l0.161-0.161  v-0.162l-0.404-1.699l-0.081-0.889l-0.081-0.081v-0.081l0.081-0.081v-0.081l0.647-1.051l0.081-0.081l0,0l1.293-0.89h0.081h2.669  l0.404-0.161l-0.081-1.375l-0.404-1.213l-0.89-1.455l-0.081-0.082v-0.081v-2.021v-0.081l0,0l0.484-1.213l0,0l0.082-0.081l0,0  l2.183-3.153l0.08-0.081h0.081l0.163-0.081h0.485l0.808,0.081l1.859,1.051l1.213,0.324l0.162-0.566l-0.243-0.162v-0.242  c0-0.485,0.243-0.889,0.728-1.294l1.456-1.051l0.081-0.081l0,0v-0.081c0.809-0.243,1.293-0.404,1.617-0.404l1.293-0.162h0.163l0,0  l0.809,0.162l0.566-2.021v-1.375c0-0.89,0-1.456,0.242-1.617l0.566-1.051l-0.728-0.97l-0.969-0.647l-2.021-0.566  c-0.404,0-1.132-0.404-2.345-1.455l-1.213-0.566h-0.081l-0.082-0.081l-1.455-1.779h-1.375l-0.081-0.082h-0.081l-1.213-0.646  l-0.728,0.97L196.349,141l0.243,1.455h0.566l0.08,0.081l1.132,0.324v0.081v0.081l0.565,1.375h0.081v0.081l0,0v0.081l-0.322,2.506  v0.162v0.081l-0.082,0.081c-0.404,0.243-0.727,0.404-1.131,0.647l-0.163,0.081l-0.081-0.081h-0.08l-0.566-0.162l-1.295,0.485h-0.08  l0.08,0.242l0.082,0.082l0.242,2.183c0,0.323-0.161,0.485-0.485,0.565h-0.97c-0.486-0.081-0.728-0.242-0.971-0.485l-0.97-0.728  l-0.081-0.081h-0.082v-0.081l-0.565-1.375c-0.162-0.162-0.566-0.404-1.375-0.647h-0.082h-0.081l-1.132-0.809h-0.161v-0.162l0,0  l-0.324-1.375l0.162-1.051h0.082v-0.081l0,0l0.484-0.566v-0.404l-0.484-1.456l-1.133-1.051v-0.162l-0.324-3.315l-0.809-0.808h-0.08  l-0.081-0.081l0,0l-0.648-1.536l-2.91-0.324c-0.728-0.242-1.213-0.728-1.537-1.375h-1.293c-0.485-0.162-0.971-0.485-1.537-1.051  l-0.161-0.162c-0.324-0.323-0.647-0.808-0.971-1.456l0,0l-0.081-0.081l-0.243-1.293l0,0v-0.081v-0.081l0,0l0.486-2.507v-0.08  l0.485-1.051v-0.082v-0.08h0.081l3.073-1.294l1.212-1.456l0.242-1.213l-0.162-0.889c-0.484-1.052-0.809-1.698-0.809-2.102  l-0.647,0.081l-1.132-0.081c-0.242,0.081-0.889,0.809-1.779,1.859l-1.374,1.294h-0.082l-0.081,0.081  c-1.051,0.242-1.779,0.404-2.183,0.242L171.444,121.029z"},{"name":"\u5b81\u590f\u56de\u65cf\u81ea\u6cbb\u533a","path":"M192.953,121.756l-1.456,4.043v2.668v0.081l-0.809,1.375l-0.162,0.97  c0.162,0.566-0.082,1.051-0.647,1.375l-0.162,0.081h-0.081l-0.081-0.081l-2.021-0.243l-1.05,0.971l-3.073,0.485l0,0h-1.294  l0.809,0.566l2.911,0.324h0.161h0.163l0.081,0.08v0.082l0.728,1.779l0.809,0.565c0.241,0.324,0.404,0.809,0.404,1.699l0.08,2.183  l0.97,0.889h0.081v0.081h0.082l0.485,1.617v0.89l-0.566,0.809l-0.162,0.728l0.243,0.808l0.97,0.647  c1.052,0.404,1.617,0.647,1.86,1.051l0.565,1.213c0.647,0.323,0.971,0.646,1.132,0.97l0.728,0.242h0.081l-0.324-1.779  c-0.081-0.404-0.081-0.809,0.08-0.97c0.163-0.242,0.324-0.404,0.648-0.485l1.213-0.404l0,0l0.08-0.082h0.081l0.082,0.082  l0.566,0.162l0.728-0.404v-0.162l0.241-2.021l-0.485-0.97l-0.647-0.324l-0.808-0.081h-0.162l-0.161-0.081l-0.324-2.102l0.081-4.124  l0.162-0.162l1.212-1.698l1.779,0.97h1.051l0.809-5.255c-0.242-0.565-0.485-0.97-0.97-1.213l-0.485-0.081v0.081h-0.243  l-1.293,0.243l-0.08-0.162l-0.081-0.081l-0.89-1.131v-0.082l-0.082-0.081v-2.021l0.324-1.132l0.324-0.484  c0-0.324,0.08-0.647,0.404-1.051l0.324-0.404l0.081-1.375l-1.213-1.132l-1.617-0.809L192.953,121.756z"},{"name":"\u65b0\u7586\u7ef4\u543e\u5c14\u81ea\u6cbb\u533a","path":"M137.728,92.648l0.081-0.081h0.081v-0.081l-2.587-7.358l-1.617-1.293v-0.162l-0.404-2.992  l-3.396-0.485h-0.081h-0.162v-0.081l-0.081-0.162v-0.081c-0.404-1.132-1.456-2.345-3.073-3.639  c-0.889-0.727-1.778-1.213-2.506-1.374c-0.566-0.324-1.132-0.566-1.537-0.89c-1.051-0.728-4.689-1.293-11.077-1.455h-0.243l0,0  l-0.728-1.133c-0.323-0.727-0.566-1.374-0.646-2.102c0-0.89,1.051-3.8,3.315-8.571l-1.132-3.558l0,0l-1.212-5.66  c-0.162-0.808-1.537-1.536-3.962-2.264c-0.485-0.162-0.97-0.323-1.455-0.647c-0.89-0.404-1.537-1.132-1.86-2.021  c-0.485-1.052-1.293-1.941-2.426-2.426l-0.081-0.081l-0.081-0.081l-0.971-5.013l-3.88,0.404l-0.404,1.051  c-0.486,1.698-0.971,2.506-1.537,2.506l-2.506,0.809c-1.537,0.565-2.507,1.213-2.992,1.94c-0.242,0.323-0.485,1.293-0.646,2.587  c-0.243,1.456-0.485,2.506-0.809,3.153c-0.485,1.051-1.212,1.86-2.345,2.264c-2.102,0.809-5.66-0.566-10.591-4.043l-6.631,8.489  l0.809,3.478h0.081l0.08,0.161l-0.161,0.081v0.081c-0.323,0.485-0.809,0.809-1.374,0.89c-0.647,0.161-1.294-0.081-2.021-0.566  c-0.647-0.486-2.507-0.89-5.499-1.051l-1.374-0.081l0,0l-2.021-0.162l-2.184,0.404l0.971,1.375  c0.809,1.051,1.131,1.698,1.051,2.102l-0.89,5.256l0.404,2.83h0.081V73l-0.081,0.082l0,0l-1.617,5.255  c-0.081,0.486-0.243,0.728-0.404,0.647h-0.162v-0.081l-0.243-0.485c-0.324-0.647-0.485-0.89-0.728-0.809  c-0.162,0.081-0.404,0.404-0.485,1.131c-0.324,1.456-1.213,2.669-2.587,3.962l-1.456,1.133l-0.728,0.404l0,0h-0.081l-5.255,0.081  l-2.021,1.941h-0.081h-0.162h-0.081l-5.579-0.809c-0.889,0.971-1.778,1.293-2.668,1.132c-0.809-0.243-2.184,0.081-4.123,0.809  l-2.265,2.668l-0.081,0.162l-3.558,0.081v-2.992h-2.265l-0.404,1.294l-1.697,0.404h-0.162l0,0l-0.08-0.081h-0.082  c-1.05-0.647-2.344-1.132-3.638-1.294c-0.727-0.081-1.617,0.405-2.911,1.536c-1.375,1.132-2.345,2.184-2.83,3.154  c0.243,0.162,0.404,0.485,0.404,0.97c0.163,0.566,0.243,1.051,0.243,1.698c-0.08,0.646-0.323,1.051-0.647,1.375  c-0.404,0.243-0.646,0.971-0.889,2.264l1.293,0.89l1.779-1.86l2.264,2.506v0.162l0.485,4.447v0.081h-0.081l-1.293,6.145h-0.324  c-1.859,0-3.072,0.081-3.558,0.404c0.082,0.404,0.891,1.051,2.265,1.941l1.132-0.162h0.242l0.082,0.081l2.668,2.587  c1.051,0.89,0.971,2.426-0.404,4.69l0.404,2.506l1.051,0.243h4.124l-2.102,1.94l1.212,0.647l0,0l1.617,0.889l4.367,1.86  l0.081,0.081h0.162l0.404,6.63c0.081,1.293,1.051,2.264,2.992,2.911l0.322-0.162h0.082h0.08l4.528,0.647h0.323v-0.081l0.081-0.162  c0.485-0.889,0.808-1.536,0.808-1.697v-0.162c-0.081-0.728,0.243-1.375,0.89-1.859c0.647-0.485,1.051-0.97,1.293-1.537l0.082-0.081  c0.242-0.647,1.051-0.809,2.426-0.404h0.08l0,0l1.537,0.889l5.094,0.971l3.153-0.243L50,133.4c0.404-0.566,0.727-0.809,0.97-0.971  c0.404-0.081,0.97,0.081,1.617,0.647l0.323,0.162c0.324,0.243,0.566,0.728,0.889,1.617l1.617,1.212h1.213h0.081h0.162h0.081  l1.698,0.729l3.153-0.243l1.779-0.566l4.609,0.404l2.021-0.566l2.345-0.97c0.485-0.323,1.051-0.566,1.859-0.809h4.447l1.617-0.566  c0.647-0.404,1.213-0.647,1.698-0.647h2.587l1.213,0.89l3.477,0.727c0.485,0,0.97,0.405,1.779,1.133l1.455,0.97l0.162,0.162  l3.315,0.081l0,0h0.081l1.537,0.808l2.021,0.404h0.081l1.698,0.243l0.485-0.971l-0.728-1.617l-0.324-1.617v-0.081h-0.081  l0.243-0.243l1.132-1.536v-0.081l0,0h0.081v-0.081l1.132-0.809l0,0l-0.242-0.485l-0.486-1.617c0-0.242-0.242-0.404-0.727-0.728l0,0  l-1.213-1.293l-1.537-1.293l-0.081-0.162l-0.162-0.082l0.081-0.08v-0.162l0.243-1.537v-1.132l-0.728-1.941l1.86-0.404l0.889-0.889  h2.265l2.264-0.324h0.081l1.536,0.162l1.779-0.647l2.021-0.242l1.293-0.566h0.081l3.478-0.646l0.565-0.566l-0.161-0.646  l-0.647-1.132v-0.081l-0.081-0.082v-0.08l0.162-1.213l0.081-0.081v-1.698l-0.323-1.456l0,0v-0.081l0.809-1.617  c0.323-0.728,0.727-1.132,1.213-1.132l2.102,0.162c0.324,0,0.728-0.162,1.132-0.486l3.153-4.285v-0.082l0.082-0.081l1.698-1.374  l0.162-0.162c0.647-0.161,1.051-0.404,1.293-0.565l0.404-0.404c0.566-0.728,1.051-1.052,1.375-1.052l2.75,0.567l2.344-1.132l0,0  h0.082l0,0h0.081l1.375-0.162L137,97.742v-1.859l0.323-2.345v-0.081l0,0v-0.081l0.404-0.647V92.648z"},{"name":"\u9752\u6d77\u7701","path":"M140.477,120.301l-0.728,0.566c0,0.323,0.162,1.051,0.404,2.102v0.081l0.081,0.081h-0.081  l-0.889,2.021l-1.213,0.486l-0.243,0.081h-0.081l-2.102-0.97h-0.082v-0.081l-3.961-3.639l-1.537-0.89l-2.426-0.889v-0.081l0,0  h-0.08l0,0l-1.132-0.809l-2.021-0.647l-1.132,0.081h-0.081l-2.587-0.162h-0.081l-1.859-0.404h-1.132l-0.889,0.646  c-0.486,0.243-1.132,0.324-1.941,0.486l-1.698,0.323l-1.456,0.486l-0.081,0.081v0.081v-0.081l-1.779,0.162l-1.86,0.728l0,0h-0.243  l-1.536-0.161l-2.344,0.323h-1.941l-0.809,0.809h-0.081l-0.971,0.243l0.404,0.97v1.537l-0.242,1.375l1.374,1.131h0.081l0,0l0,0  l1.132,1.294c0.728,0.566,1.052,0.97,1.052,1.455l0.404,1.213l0.565,1.213c-0.081,0-0.081,0.081-0.161,0.081l-1.537,1.132  l-1.051,1.375l0.243,1.213l0.728,1.698l0.081,0.162l0,0v0.081l-0.162,0.647c-0.162,0.404-0.323,0.728-0.566,0.889  c-0.485,0.404-1.293,0.404-2.587,0l-2.021-0.404h-0.081l0,0h-0.081l-1.455-0.728l-2.345-0.081l0.081,0.081l-0.243,4.043  c-0.081,0.566-0.485,0.809-1.051,0.89c-0.243,0.081-0.404,0.404-0.324,1.051v0.081h-0.081l-0.162,1.051  c0.566,0.485,0.971,0.89,1.132,1.213l0.404,1.94v0.728c-0.081,0.404-0.162,0.727-0.324,1.051l-0.566,1.617l-1.051,2.021v0.404  l0.162,0.97l1.051,1.375c0.324,0.404,0.486,0.647,0.566,0.89l0.97,1.375l1.455,1.617c0.566,0.565,0.97,0.809,1.133,0.809  l1.536-0.971c0.323-0.242,0.566-0.404,0.97-0.404c0.324,0,0.809,0.243,1.537,0.728l0,0h0.081v0.081l0.809,0.971l0.404,0.97  l0.324,0.404l0.242,0.162l1.051,0.728l0.566,0.081c0.323,0.081,0.647,0.323,0.889,0.646c0.162,0.243,1.051,0.566,2.587,0.971h0.081  l2.426,0.89h0.081h0.081l1.698,0.809l2.911,0.727l0.081,0.082l3.8,0.161l1.698-0.647h1.536v0.082l0.081,0.081l1.293,1.617l0,0  v0.081l0.809,1.294l0.646,0.728l0.89,0.404l0.081,0.081l0,0l0.081,0.081l0.728,1.617v0.082h0.081v0.081l0.404,1.779l1.132,0.404  h0.081h0.081l0,0l0.89,0.566l1.213-0.244l0.323-1.212v-0.081l0.081-0.081l1.375-1.375l1.537,0.404v0.162l0.727,1.617l1.537-0.566  l0.162-1.537v-0.081V173.1l0.081-0.081l1.051-0.566l-0.243-2.264v-0.162v-0.081l0,0l1.213-2.507l1.213-0.485l-0.484-2.264h1.212  l-0.081-1.051l-0.647-2.184l0,0v-0.162l0.162-1.537v-0.243l0.162-0.081l0.809-1.051l0.162-0.162h0.243l2.183,0.404h0.081  l1.779,0.485l1.536-0.485l0.89,1.779l0.081,0.081v1.293l0.242,1.213c0.162,0.485,0.486,0.809,0.809,0.89h0.162  c0.729,0.162,1.132,0.485,1.213,0.971c0.081,0.404,0.404,0.969,0.97,1.617l0.728,1.051l0,0v0.08l0.485,0.891l0.728-0.082  l1.375-1.213l0.889,1.86l1.778,0.566h0.081l0.081,0.082l0.89,1.617l0.404,0.242l0.08-1.537v-0.081v-0.242l3.558-0.082l0.081-0.322  c0.081-0.163,0.081-0.486-0.081-0.729c-0.243-0.484-0.324-0.889-0.404-1.455c-0.081-0.646,0-1.132,0.162-1.294  c0.243-0.323,0.404-0.323,0.809-0.242l1.456,0.485l0.161-1.052l-2.668-1.212h-0.162l-0.081-0.161v-0.081v-0.081l-0.404-3.234  l0.081-2.021v-0.242v-0.162l4.447,0.566l1.132-1.051c0.242-0.404,0.162-0.728,0-0.809c-1.132-0.404-1.698-0.889-1.698-1.375  c0-0.243,0.081-0.566,0.485-0.728l1.859-1.86l2.021-0.081l1.051-1.779v-1.698l1.536-0.323c0.404-1.213,0.647-1.86,0.809-2.103  l0.647-1.374l-1.132-2.021v-0.081l0,0v-0.081l-0.728-2.749v-0.081l-0.485-2.83l-0.97-1.617l-1.455-1.456v-0.081v-0.081  l-0.082-0.081l-0.081-1.536l-2.668,0.809l-0.082-0.081l-1.212-1.375l-3.639-2.749h-0.081l-1.375-1.779l-0.889-0.566l-0.566,0.89  v0.162l-0.081,0.081h-0.081h-0.162l-1.131,0.081l-0.162,0.082h-0.081l-2.668-2.912c-0.566-0.242-1.132-0.809-1.94-1.617  l-1.213-0.889l-0.081-0.081l-1.375-0.809l-0.809,0.647l-0.081,0.162l-0.08-0.081h-0.082l-0.727-0.162l-0.809,0.404l-0.082,0.081  l-0.081,0.081h-0.081l-1.132,0.162C143.63,122.161,142.094,121.271,140.477,120.301z"},{"name":"\u56db\u5ddd\u7701","path":"M145.247,160.001l-1.859-0.566l-1.94-0.242l-0.647,0.727l-0.162,1.375l0.081,0.081l0.566,2.103  l0.081,1.617v0.485h-0.97l0.404,1.94l-1.536,0.566l-0.647,1.213l0.809,0.646l0.162,0.081l0,0l2.83,2.264l0.081,0.081h0.081v0.081  v0.082l0.404,2.021l1.293,1.859c0.324,0.485,0.728,0.971,1.456,1.617h0.081l0.081,0.08v0.082l-0.081,0.161v1.779  c0.242,0.485,0.324,1.536,0.324,3.072c0.727,1.052,1.051,1.779,1.051,2.265c0,0.323,0.243,0.97,0.647,1.859l0,0v0.08l0,0  c0.162,1.133,0.081,2.104-0.162,2.912c-0.242,0.565,0.082,1.617,0.97,3.072l0.081,0.081l0.081,0.162l-0.081,0.162l-1.293,2.83  c0.242,0.647,0.324,1.131,0.324,1.456l-0.324,2.668c-0.162,0.89-0.162,1.375,0.242,1.536l0.486,0.323  c0.727,0.324,0.97,0.728,0.97,1.132l-0.081,1.375l0.404,0.162l0.081,0.081l0.243-0.243c0.242-0.242,0.484-0.566,0.565-0.97  l0.162-0.243l0.081-0.162c0.323-0.162,0.485-0.404,0.728-0.728c0.081-0.485,0.081-0.97-0.081-1.536l-0.162-0.404l0.404-0.081  c1.294-0.323,2.021-0.242,2.264,0.324l0.646,1.617v0.081v0.081l0.324,2.668l1.051,0.566h0.082h0.081l0.646,0.566l0.647-0.728  l0.728-0.566h0.242c0.566,0.162,0.89,0.566,1.051,1.132l0.323,2.103l0.081,0.323l2.183,4.689l0.89,0.889l0.081,0.081v0.081  l0.404,1.941l0,0l0.162,1.86l0.081,0.162c0.566-0.809,1.051-1.213,1.375-1.051c0.324,0.081,0.404,0.242,0.404,0.565v0.485v1.456  v0.404c0.404,0.081,0.728,0,0.809-0.242l0.809-1.132l0.889-0.889c0.566-0.404,1.132-0.728,1.779-0.728h0.082l1.697,0.404  l0.485-0.242l0.889-1.132l-0.162-1.778c-0.565-0.971-0.809-1.779-0.647-2.345l0.243-1.456v-0.162l0.081-0.162l0,0l1.536-0.889  h0.081l0,0l1.132-0.729l1.293-1.859l0.162-1.375l-1.455-3.396l3.234,1.456v-1.375l0,0v-0.081l1.213-1.051l2.345-0.647h0.161  l1.375,2.992v0.162l-0.162,1.132l0.162,1.051c0.162,0.485,0.486,0.728,0.727,0.728c0.324,0,0.648-0.243,0.972-0.647l0.081-0.162  l0,0h0.081l1.941-0.647l0,0h0.08c1.052,0,1.537,0.243,1.779,0.728l0.162,2.183v0.082l0.404,0.081l0.809,0.243l1.213-0.081  l2.021-0.566l1.213-1.051l0.081-0.89l-0.565-0.646l-2.103-0.728l0,0l-0.162-0.081l0,0v-0.081l-2.426-2.426l0.243-0.162l1.213-1.051  l0.081-0.081l0,0l1.213-0.485l0,0h0.243l1.617,0.324h0.081l0.081,0.081v-0.647l-0.728-1.212l-1.132-0.566l-1.536-2.264l0,0  l-0.082-0.081v-0.081l-0.727-2.668v-2.021l1.294-1.213h1.94l4.528,0.404l2.102-2.991v-0.163h0.161l1.699-0.889l0.89-1.779  l0.081-0.081l2.021-1.698l0.969-1.779v-0.081h0.082v-0.081l0,0l0.809-0.808l0.97-1.617l0.324-2.507v-0.242l0.081-0.081l1.293-0.89  l0.324-0.323l-1.941-0.324l-3.234,0.162l-0.081-0.081l-1.213-0.97h-0.162v-0.082l0,0l-0.647-0.97l-0.162,0.081l-0.082,0.162  c-0.161,0.242-0.565,0.323-1.05,0.323l-0.486,0.243c-0.162,0.081-0.242,0.162-0.485,0.081c-0.161,0-0.241-0.242-0.404-0.646  c-0.081-0.404-0.241-0.809-0.728-1.213l-0.081-0.082v-0.081h-0.081l-0.404-1.05h-0.324l-1.213,0.808l-0.081,0.081h-0.08  l-2.83,0.566h-0.162l-0.162-0.081l-1.859-1.293l0,0l-0.082-0.08v-0.082h-0.081l-0.485-0.97l-1.375,1.456  c-0.97,1.131-1.698,1.455-2.183,1.131l-1.859-0.97l-1.295-0.161l-0.161,0.081l-1.213-0.889l-0.081-0.082l-0.243-0.081l0.566-2.183  v-0.729l-0.727-0.323h-0.082l-1.698-1.859l0.081-1.375l-4.205-0.404l-1.617-0.89c-0.404-0.243-0.728-0.728-0.97-1.536l-0.243-0.566  l-0.324-1.213l-0.566,0.081l-1.293,1.051l-1.537,1.859l0.324,1.375l0.484,1.778v0.081h0.081l-0.081,0.081v0.081  c-0.162,0.485-0.646,0.728-1.375,0.728h-1.617l-0.97-0.485l-1.213,0.485l-0.242,0.081l-0.162-0.081l-0.161,1.132l-0.081,0.162  v0.242h-0.243l-2.021-0.646c0,0.646,0.081,1.131,0.404,1.697c0.243,0.566,0.324,0.97,0.081,1.455l-0.243,0.647  c-0.243,0.243-0.97,0.324-2.021,0.243h-1.375l-0.081,2.264l-1.779-0.646h-0.081l-0.081-0.082l-0.889-1.698l-1.941-0.646  l-0.485-1.052l-0.728,0.566h-0.081l-1.213,0.243h-0.323l-0.647-1.456l-0.647-0.889l-0.081-0.082  c-0.647-0.809-0.971-1.536-1.132-1.94c0-0.082-0.162-0.242-0.566-0.323l-0.323-0.081c-0.566-0.242-0.971-0.728-1.213-1.455  l-0.324-1.375v-1.132l-0.566-1.051l-0.97,0.324h-0.081h-0.081H145.247z"},{"name":"\u897f\u85cf\u81ea\u6cbb\u533a","path":"M36.254,133.562v0.081c-0.324,0.728-0.89,1.213-1.537,1.779  c-0.485,0.242-0.647,0.646-0.647,1.132v0.243c0,0.404-0.242,1.051-0.89,2.021l-0.081,0.404c-0.162,0.243-0.485,0.404-1.051,0.404  l-4.609-0.566v0.081l-0.323,1.051v0.081l-0.081,0.081l0,0c-1.212,1.698-2.021,2.911-2.102,3.719  c-0.082,0.404,0.404,1.859,1.455,4.366l0.728,1.698c0.323,0.809,0.081,1.779-0.647,2.83l-1.455,1.456h-2.426l-0.485-2.668  l-0.647,3.315l1.051,1.617c0.081,0.243,0.081,0.404,0,0.486l-0.162,0.162c-0.324,0.243-0.809,1.051-1.293,2.425  c-0.485,1.213-0.243,2.426,0.728,3.72h1.941c0.646,0.162,1.617,1.213,2.991,3.073l0.081,0.162l0,0c0,0.566,0.242,0.971,0.646,1.293  l4.285,3.962v0.081l1.941,2.426h1.132l1.213-2.183l0.162-0.161l0.082-0.082l2.991,0.728v0.081v0.162l0.404,2.021l3.558,4.123  l1.213,0.486l0.081,0.081l0.566,0.323l0.082,0.081l2.668,3.962L50,183.773h0.162h0.081l0.162,0.162l0.081,0.162l1.859,3.881  l2.264,1.375l1.86,0.485l0.889,2.507h1.375l0.08,0.081l0,0l2.912,1.617v0.081l0,0l0.081,0.081l2.103,2.588l3.073-0.566h0.161  l1.132,0.485h0.081l1.94,1.699l3.478,0.242l2.102-0.324l0,0c2.83-0.485,4.609-0.242,5.256,0.486  c0.404,0.646,0.162,1.293-0.809,2.102l-0.809,0.809c-0.243,0.404,0.081,1.051,1.132,2.021l0.081,0.162h-0.081l0.646,0.485  l0.243-0.243c2.021-3.8,3.638-5.902,4.771-6.307c1.212-0.404,3.719,0.647,7.681,3.072l4.851,0.889l-0.081,0.162v0.162l-0.243,2.264  l2.426,0.323l-0.081,3.073c0.728,1.375,1.293,2.183,1.617,2.426c0.485,0.324,2.911,0.324,7.196,0l2.507-1.293l2.426-3.396  l2.83-0.081l1.374-0.404l5.336-3.072h0.081l0.082-0.081l0,0c3.072-0.323,4.851-0.404,5.336,0l3.477,2.911l1.051,0.404l0.162,0.162  l1.375,0.566l0.081,0.081v-0.243v-0.081v-0.081v-0.081l0.566-2.426c-0.242-0.728-0.242-1.294,0-1.779  c0.162-0.404,0.566-0.646,1.213-0.809c1.213-0.243,2.345,0.809,3.477,3.073l0.162,0.081h0.081l2.021-0.89  c0.404-0.081,0.565-0.485,0.565-0.89l-0.404-1.455v-0.082c-0.161-0.647,0-1.213,0.647-1.456l0.727-0.566l1.779-1.94l1.213-2.669  c-1.051-1.698-1.375-2.911-1.051-3.719l0.243-2.264c-0.485-0.97-0.728-1.617-0.728-2.183c0-0.243-0.323-0.97-0.97-1.941h-0.082  v-0.242l-0.242-2.911c-0.081-0.485-0.162-1.132,0-1.941c-0.728-0.566-1.213-1.131-1.537-1.697l-1.212-1.617l-0.081-0.081v-0.161  v-0.082l-0.404-2.021l-1.213-0.97v0.081l-2.345-1.859v0.161l0.323,2.507v0.081v0.243l-1.213,0.566l-0.162,1.537v0.243l-2.83,1.132  l-0.97-2.265l-0.565-0.161l-0.89,0.889l-0.566,1.617l-2.021,0.566l-1.132-0.809l-1.617-0.486l-0.485-2.264l-0.647-1.375  l-0.97-0.404l-0.081-0.161l-0.728-0.89l0,0l-0.728-1.293l-1.132-1.455h-0.97l-1.617,0.565l-0.081,0.082l-4.123-0.242l-3.154-0.648  c-0.243-0.161-0.809-0.404-1.698-0.969l-2.426-0.809c-1.86-0.485-2.911-0.89-3.153-1.375l-0.404-0.242l-0.566-0.162l-1.455-0.809  l-0.162-0.081c-0.242-0.323-0.485-0.565-0.646-0.889l-0.324-0.728l-0.646-0.97l-1.051-0.486l-0.404,0.243l-0.404,0.324  l-0.243,0.162c-0.404,0.323-0.809,0.485-1.132,0.566c-0.647,0.161-1.293-0.162-2.021-0.971l-1.536-1.617  c-0.566-0.728-0.971-1.293-1.132-1.698l-0.404-0.647c-0.566-0.565-0.97-1.131-1.213-1.617c-0.243-0.728-0.324-1.375-0.081-2.021  v-0.081l0,0l1.051-1.779l0.566-1.86l0.242-1.213l-0.404-1.859l-1.213-1.051l0.243-1.536c0-1.132,0.404-1.698,1.213-1.86  c0.242-0.081,0.404-0.242,0.324-0.566v-0.081l0.081-1.617v-0.081l0,0v-1.86h-0.162l-0.081-0.081l0,0l0,0l-0.324-0.162v-0.082  h-0.081l-1.455-0.97l0,0H90.67l-1.132-0.97l-3.801-0.728l0,0l-1.212-0.89h-2.264c-0.324,0-0.728,0.243-1.294,0.566h-0.081  l-1.779,0.647H74.66c-0.646,0.162-1.212,0.323-1.536,0.647c-0.485,0.404-1.375,0.728-2.588,1.132l-2.102,0.485v0.081h-0.162  l-2.992-0.323l-0.242-0.082l0.081,0.082l-0.081-0.082l-1.051-0.08l-1.779,0.566l-3.558,0.323H58.57l-0.08-0.081l-1.779-0.646  h-1.455c-0.647-0.162-1.375-0.647-2.184-1.617l-0.081-0.162c-0.162-0.729-0.404-1.051-0.485-1.213l-0.404-0.243l-0.728-0.404  l-0.647,0.647l-0.081,0.162l-2.587,1.051h-0.08h-0.162l-3.154,0.323c-0.485,0-1.375-0.243-2.587-0.566l-2.75-0.486h-0.081l0,0  l-1.617-0.889H36.254z"},{"name":"\u4e91\u5357\u7701","path":"M136.839,234.227l-0.324,1.051c0.485,0,1.132-0.324,1.779-0.809l0.081-0.081h0.162  l3.234-0.404l2.102-1.052l0.809,1.132l0.162,0.081l-0.97,1.537l1.132,1.132v0.081v0.243l-0.809,3.396l2.102,1.537l3.8,0.161  l-0.566,0.728c-2.426,2.992-3.558,4.771-3.477,5.336l1.456,0.324c1.94,0.162,3.073,0.728,3.477,1.456  c0.485,0.97,0.97,1.94,1.375,3.072l2.184,1.213l1.374,0.243l2.83-2.425l1.456,2.182v0.081l0,0l0.082,0.081l0.484,2.022l1.213,0.242  l0,0l1.86,0.647l0.485-0.162v-0.081l-0.324-2.102l-0.081-0.081l-1.051-4.771v-0.162l0.647-3.315l0.162,0.081h0.243l2.183,0.162  l2.75-2.021l0.242,0.162c1.456,1.132,2.426,2.021,2.911,2.668c0.485-0.162,1.375-1.051,2.587-2.426l0.081-0.081l0.162-0.162  l4.043,1.051l1.778-1.456l0.081-0.081l0.081-0.081h0.082l0.08,0.081l1.698,0.324l5.499-4.851l1.697,0.484l0,0l0.081,0.082  l0.081,0.081l0.082,0.081l0.404,0.727l0.404-0.484h0.081v-0.082h0.081l1.617-0.889l1.213-1.133l-0.324-2.506l-0.242-0.324  l-1.536,0.647l0,0c-0.485,0.161-0.89,0.323-1.456,0.323h-1.778c-0.567-0.081-0.891-0.243-1.133-0.566l-0.162-2.587  c-0.566-0.324-0.808-0.486-1.05-0.486l-0.404,0.162l-0.566,0.324l-1.132,0.242h-0.324l-0.081-0.162l-0.647-1.132l-0.081-1.051l0,0  l0.646-3.072l0,0h0.082v-0.081l0.728-1.537l-2.265-2.021l-0.081-0.081l-0.081-0.081v-2.345l0.081-0.081l1.294-3.719l-0.809-2.021  l-0.728-0.162l-0.89,0.081l-0.889,1.375l-1.132-0.809l-1.132-0.646l-0.889-2.264l0,0l0,0l-0.324-1.617v-0.162l-0.081-0.081  l0.242-0.162l1.051-1.455l0.243-0.162l0,0h0.081l0.809-0.162l0.889-0.243l4.205-0.161h0.081l0.565,0.242l0.162,0.082l0.646,0.242  l1.133-0.486l0.969-0.727l0.485-0.809l0.082-0.404l-0.082-1.779l-0.89-0.162l-1.698,0.566c-0.484,0.566-1.05,0.97-1.617,0.97  c-0.565,0-1.051-0.485-1.537-1.375l0,0h-0.081v-0.081l-0.081-1.132V205.2l0.081-1.051l-0.89-2.183l-1.697,0.485l-0.728,0.646  l0.242,2.426l-2.668-1.213l0.646,1.456l0.082,0.081v0.162l-0.243,1.617v0.162h-0.081l-1.537,2.183l0,0l-2.506,1.536l-0.243,1.456  c-0.081,0.242,0.243,0.889,0.647,1.698l0.081,0.081v0.081l0.162,2.102v0.243l-0.082,0.081l-0.97,1.293l0,0l-0.081,0.082h-0.081  l-0.728,0.485h-0.081h-0.081h-0.081h-0.081l-1.859-0.404c-0.324,0-0.728,0.162-1.132,0.484l-0.809,0.89l-0.646,0.809  c-0.404,0.727-0.971,0.889-1.86,0.727c-0.566-0.081-0.728-0.646-0.566-1.374v-0.566l-0.081-0.566l-0.324,0.404  c-0.243,0.324-0.485,0.404-0.809,0.404c-0.323-0.08-0.566-0.404-0.728-0.97v-0.081l-0.162-1.859l-0.404-1.779l-0.809-0.809l0,0  l-0.081-0.081l-1.698-3.881l-0.081-0.081l-0.485-1.132v-0.08h-0.08v-0.082l-0.324-2.102l-0.242-0.324l-0.324,0.243  c-0.566,0.646-0.97,1.051-1.131,1.051c-0.243,0-0.647-0.323-1.294-0.809l-1.212-0.566l-0.163-0.081l-0.081-0.081v-0.081  l-0.081-0.162l-0.081-1.617l0,0l-0.243-1.213l-0.647-1.617h-0.646c0.081,0.647,0,1.213-0.162,1.617  c-0.162,0.485-0.485,0.809-0.97,1.213c-0.162,0.566-0.404,0.97-0.728,1.293c-0.485,0.485-0.89,0.485-1.374,0.162l-0.243-0.081  c-0.485-0.162-0.565-0.728-0.485-1.779v-0.404l-1.051-0.647c-0.404-0.162-0.646-0.646-0.728-1.375l0.404-3.638l-0.162-0.566  l-1.293,1.455l-0.889,0.648l-0.243,0.565c0.324,0.728,0.485,1.294,0.485,1.698c0,0.809-0.404,1.456-1.132,1.698l-1.456,0.566  l-0.404,0.243l-0.081,0.566v2.264c0.081,0.728,0.162,1.132,0.404,1.132c0.485,0.243,1.051,0.243,1.536-0.162l0.485-0.243  l1.536,3.557v0.081l0,0v0.162c-0.566,6.387-1.131,10.026-1.859,10.996c-0.324,0.324-0.566,0.485-1.051,0.566  c-0.566,0-0.97-0.081-1.536-0.404c-2.103,4.205-3.477,6.388-4.124,6.711h0.081c-0.323,0.08-0.485,1.132-0.404,2.992l0.486,0.404  l0.161,0.163l0.162,0.161L136.839,234.227z"},{"name":"\u8d35\u5dde\u7701","path":"M208.073,197.276l-0.566-0.243l-0.647,0.404l-0.404,0.727  c-0.324,0.728-0.648,1.133-1.213,1.133c-0.324,0-0.728-0.243-0.97-0.485l-0.082-0.082l-0.081-0.081l0,0l-0.242-0.809v-0.082  l-0.082-1.051l-0.485-0.081l-0.081,0.081l-0.243,0.809v1.132l-0.081,0.081l-0.081,0.082l-0.97,1.293l-0.162,0.162h-0.161  l-1.941-0.162h-0.162v0.081l0,0v0.081l-0.646,0.89l0.242,0.566h0.082l-0.567,0.889h-1.778v-0.323l-0.162-0.162l-0.243-0.162  l-0.324,0.566l-0.081,0.243h-1.213l-0.081-0.081l-0.728-0.566l-0.081-0.162v-0.081h-0.081v-0.162l-1.294-0.243l-0.97,0.404  l-0.566,0.404l1.617,1.86l2.103,0.647l0.081,0.081l0,0l0.081,0.081l1.052,0.97l-0.404,1.617l0,0v0.243h-0.081l-1.375,1.132V209  h-0.081l-2.265,0.646h-0.081l-1.293,0.162l0,0h-0.081l0,0h-0.081l-0.89-0.324l-0.485-0.08l-0.485,0.809h-0.08v0.08l-1.052,0.728  h-0.08l0,0l-1.457,0.646h-0.081l-1.697-0.566l-3.719,0.162l-0.809,0.243l-0.082,0.081h-0.727l-0.89,1.213l0.162,1.375l0.809,1.859  l0.889,0.485h0.081v0.082l0.323,0.242l0.566-0.809l0.082-0.081l0.08-0.081h0.081l1.213-0.162h0.162v0.082l1.213,0.323l1.213,2.75  h-0.082v0.081l-0.484,1.536l0,0l-0.404,0.971v0.08l-0.565,1.375v1.698l0.97,0.97h0.08l1.295,1.132l0.162,0.081l0.08,0.081  l-0.969,2.265l-0.243,1.051l0.324-0.162h0.081l0.808-0.324l1.457-0.809h0.081l1.617,0.244h0.081l0,0l2.426,0.969h2.669l0.728-0.969  l0.081-0.081l0.081-0.081l1.374-0.646l1.294-1.132l0.163-0.081l0,0l0.969-0.324l1.052-0.809l1.213-1.617l1.698,0.647l0.243,0.081  v0.081l0.081,0.081c0.243,0.647,0.485,0.971,0.728,1.052l1.05-0.162h0.244l0.565,0.162h0.082v0.081l1.375,0.485h0.404l0.08-0.323  l0.163-0.485v-0.081l0.081-0.081l0.081-0.081v-0.081l0.484-0.323l0.081-0.081l0.89-0.728h0.082l0.08-0.081h0.161l0.809,0.081  c0-0.485,0.243-0.971,0.728-1.456c0.566-0.404,0.971-0.647,1.213-0.566l0.485-0.323h0.082v-0.082l0.404-0.404v-0.081h0.081  l0.081-0.082h0.081l1.293-0.323h0.728l0.324-0.242l0.243-0.486l0,0l0.404-0.808l-0.162-0.081c-0.485-0.566-0.809-1.213-0.97-2.103  l-0.081-0.081l0,0h0.081v-0.081l0.323-1.779c0-0.566,0.162-0.97,0.566-1.375l-0.162-1.456c-0.082-0.162-0.243-0.324-0.647-0.404  l-2.587,1.051l0.162-2.668c0.081-0.405,0.889-1.133,2.426-2.021l-0.728-2.83c-0.161-0.97,0.081-1.698,0.728-2.345l-0.162-0.485  h-0.809l-0.243,0.081l-0.404,1.132c-0.324,0.404-0.647,0.647-0.97,0.647H212.6l-0.809-0.566h-0.081h-0.081v-0.081v-0.162  l-0.243-0.566l-0.081-0.809v-0.081l-0.081,0.162l-0.081,0.242h-1.456l-0.162-0.323l-0.243-0.89v-1.212l-0.889-1.537v-1.293  L208.073,197.276z"},{"name":"\u5e7f\u897f\u58ee\u65cf\u81ea\u6cbb\u533a","path":"M224.486,218.218l0.081,0.081l0.161,0.162l-1.051,1.617c-0.404,0.485-0.971,0.809-1.617,0.809  h-0.162l-0.809-0.486l-0.809,0.082l-1.617,1.213c-0.404,0.162-0.889-0.242-1.617-1.213l-0.485,1.051h-0.081l0,0l-0.081,0.081l0,0  l-0.566,0.566h-1.051l-1.051,0.323l-1.293,0.971h-0.404l-0.485,0.323c-0.404,0.404-0.566,0.728-0.323,1.051l0.565,0.809  l-2.264-0.242l-1.213,0.97l-0.162,0.404v0.081l-0.242,0.647l-0.082,0.081l-0.081,0.081h-1.132l-1.454-0.565l-0.485-0.081  l-1.132,0.162c-0.485,0-1.052-0.566-1.537-1.456l-0.971-0.404l-0.809,1.213l0,0h-0.081l-1.132,0.971h-0.081v0.081h-0.161  l-0.889,0.243l-1.294,1.132l0,0l-1.375,0.647l-0.97,1.293h-3.234l0,0l-2.507-0.969l-1.375-0.162l-1.213,0.647h-0.08l0,0  l-0.809,0.324c-0.404,0.161-0.728,0.404-0.97,0.485l-0.162,0.404v0.971l0.404,0.646l1.941-0.646c0.404,0,0.969,0.242,1.697,0.646  l0.162,0.081l0.082,0.081l0.08,2.749l0.404,0.081h1.698l1.052-0.242l0.161-0.162c0.647-0.324,1.213-0.566,1.941-0.646l0.324-0.082  l0.161,0.243l0.484,0.97v0.082l0.244,2.668v0.243l-1.456,1.537h-0.081v0.08l-1.698,0.809l-0.566,0.647l0.242,0.486l3.478,0.323  l0.081,0.082l0,0l0.081,0.08l1.375,0.809l3.072-0.08v0.404l0.162,1.536v0.162h0.082l-1.376,1.375  c-0.161,1.779,0.163,2.83,0.89,3.073l2.588,1.375l2.021,1.375l1.698-0.809l0.162-0.082l0.162-0.08l0.081,0.08l2.587,1.941  l0.404,0.162l0.646-0.809l0.162-0.162l0.082-0.082h0.08h0.081l1.537,0.243l0.324-2.669l1.94,3.478l1.617,0.081l0.242,0.081h0.162  v0.162v1.051l0.646-0.161l2.669-3.558l1.131,1.697v-0.565l0,0v-0.082v-0.081l0.809-1.617l0.727-1.213h2.021l0.324-2.264h0.243  l0.161,0.081l1.537,0.243l0.161-0.809l-0.565-1.294v-0.162l0.324-0.889v-0.162l0.081-0.081h0.081v-0.081l4.205-2.263l-0.162-2.184  l0,0v-0.081l0.809-1.617l0.162-0.324l0,0l1.294-2.992l0.081-0.081l0,0l1.051-1.051l0.646-1.212v-0.163l0,0l0.566-0.97l-0.486-1.213  v-0.08h-0.081v-1.295h-0.646l-1.213,0.567c-0.566,0.404-1.375,0.242-2.426-0.404c-0.404-0.324-0.404-1.132-0.162-2.345  l-0.646-0.081l-0.323,0.404c-0.728,0.809-1.294,1.293-1.456,1.293c-0.161,0-0.242,0-0.404-0.08  c-0.081-0.243-0.242-0.647-0.242-1.293c0-0.728,0-1.213,0.242-1.375c0.162-0.242,0.324-0.323,0.484-0.162l1.537-2.83l0.404-1.051  l0.244-1.212l-0.89-0.728c-0.243-0.243-0.323-0.809-0.163-1.617v-0.485c0-0.242-0.161-0.566-0.484-0.809h-0.162l-0.082,0.243  c-0.241,0.646-0.809,0.97-1.697,0.728C225.537,218.056,225.052,218.056,224.486,218.218L224.486,218.218z"},{"name":"\u91cd\u5e86\u5e02","path":"M219.634,180.7l-0.566-1.293l-0.889-1.295l-0.97-0.242h-0.082v-0.08h-0.08l-0.809-0.404l0,0  h-0.161l-0.324,0.081l-1.052,0.162h-0.081l-0.161-0.082l-1.052-0.404v-0.08h-0.081v-0.081l0,0l-0.809-0.809l-0.889-0.89  l-0.808-0.485l-0.89,0.809l-1.131,0.809l-0.324,2.426v0.08l0,0l-1.052,1.779v0.162h-0.081l-0.809,0.809l-0.969,1.86l0,0  l-0.081,0.162c-0.728,0.566-1.375,1.132-2.021,1.617l-0.809,1.456c-0.162,0.404-0.809,0.889-2.022,1.375l-0.809,1.375l0,0  l-1.375,1.859h-0.081v0.081h-0.162l-6.468-0.404l-0.728,0.728v1.375l0.646,2.668l1.375,1.94l1.132,0.648v0.081h0.081l0,0  c0.646,0.809,0.97,1.375,0.97,1.778v1.051l-0.404,0.404l0.243,0.162h0.323l0.485-0.97h0.161l1.293,0.404l0.081,0.404h0.647l0,0  l-0.161-0.484l-0.082-0.163l0.891-1.375c0.161-0.404,0.565-0.566,1.131-0.404l1.456,0.08l0.809-1.051v-0.97l0.324-1.051v-0.081  l0.081-0.081l0.081-0.081l0.567-0.324v-0.081h0.081l0.081,0.081l1.213,0.162v0.162l0.243,0.97v0.485l0.161,0.728l0.324,0.081  l0.404-0.566v-0.08l0.647-0.889l0.081-0.162l0.889-0.404h0.08l0.081-0.081l1.052,0.324h0.08l0.162,0.081l0.566,1.132v1.132  l0.809,1.536l0,0v0.162v1.132l0.243,0.485h0.242l0.324-0.404l0.081-0.162l0.971,0.566h0.081h0.081v0.162v0.081l0.324,1.375  l0.404,0.243l0.081-0.162l0.404-1.051v-0.081l0.081-0.162h0.081h0.082l0.566-0.324h0.081v-0.081h0.728l-0.162-0.404v-0.162  l-0.404-3.801l-1.536-2.506l-2.911-3.396l-0.082-0.081l-0.161-2.183l-0.97-1.697v-0.081l-0.082-0.081l0,0l0.082-0.162l0.486-2.102  h0.161h0.162l5.094-0.324l2.75-1.456l0,0l0.08-0.081c0.97-0.323,1.617-0.728,1.779-1.132  C219.473,182.075,219.634,181.509,219.634,180.7z"},{"name":"\u9655\u897f\u7701","path":"M201.928,131.54l-0.486-0.081l-0.809,4.932l1.375,1.617l1.293,0.566l0,0h0.081l0.082,0.081  l1.698,1.375l2.345,0.566h0.081l1.213,0.809h0.08l0,0v0.162l0.889,1.293l0.162,0.162l-0.082,0.162l-0.809,1.294  c-0.161,0.162-0.161,0.566-0.161,1.213h0.081v1.536l-0.081,0.081l0,0l-0.728,2.426l-0.08,0.404h-0.162l-0.242-0.081l-1.052-0.243  l-1.374,0.082l-1.213,0.404l-1.375,1.131l-0.323,0.324l1.778,0.889l-0.161,0.324c-0.081,0.404-0.485,0.809-1.132,1.051  l-1.132,0.081l-1.86-0.728l0,0l0,0l-1.698-0.97h-0.728l-2.021,2.911l-0.404,0.97v1.699l0.809,1.374v0.081l0,0l0,0l0.485,1.293  v0.162l0.081,1.86v0.242l0.08,0.162l-1.293,0.242h-2.426l-1.132,0.728l-0.485,0.809l0.081,0.08l0.485,2.426h0.082v0.97l0.566,1.132  l1.698,1.132l2.506-0.565l1.213-0.809l0.163-0.082h1.131l0.647,1.537c0.404,0.404,0.728,0.809,0.889,1.293l0.567-0.081h0.161h0.162  l0.082-0.162l1.132-0.889l1.051,1.859l1.132,0.728h1.617l1.213-0.161h0.242l2.912,0.404h0.08v0.081l1.213,0.728l0,0l0,0v0.081  l1.051,0.809v0.081l0.727,0.809l0.809,0.324l1.294-0.163v-1.697l-0.647-1.132h-0.081v-0.081l-0.485-2.103l1.131-1.132l0.082-0.081  h0.081l0.97-0.161h1.052l0.322-0.405l-0.646-0.89l-2.345-1.535l-0.565-0.891l-0.081-0.08l-0.082-0.082l0.082-0.161l0.646-1.213  l0.162,0.161l1.617,0.405l4.285-0.161l0.081,0.081h0.082l1.213,0.404l0.809-0.729l-0.404-2.506l-1.536-0.971  c-1.294-0.727-1.698-2.506-1.456-5.417l-1.293-0.647l-0.163-0.08h-0.162v-0.162v-0.081l-0.243-2.103l1.779-8.247  c-0.728-2.426-1.132-4.042-1.132-4.851l-0.161-2.426l0.161-2.668v-0.162l0.162-0.162l0,0l1.618-1.213v-1.294  c0-0.323-0.162-0.809-0.566-1.455l-1.051-1.132h-0.162v-0.243l-0.161-1.94v-0.082l-0.082-0.081l0.163-0.081v-0.081l2.102-2.668  v-1.132l-0.646-1.213v-0.081l-0.082-0.162l1.052-1.294v-0.081h0.081l1.132-0.889l-0.162-1.051h-0.566l-0.889-0.162l-0.484,1.94  l-0.244-0.081l-2.102-0.809l-1.293-0.243l0.485,2.021l-1.779,0.565l-2.588,1.375l-0.809,1.051l0,0v0.081h-0.081l-1.375,1.213  l-0.243,1.94v0.162l-0.728,2.749h0.081l-0.323,1.294v0.081l0,0l-0.082,0.081l-0.889,1.213h-0.08v0.081l-0.081,0.081h-0.082  l-1.94,0.242l0,0v0.081l-0.081-0.081l0,0l-2.912-0.97l-0.081-0.081L201.928,131.54z"},{"name":"\u5c71\u897f\u7701","path":"M239.687,109.79l0.324-0.404l-0.566-1.293l-0.567-0.646l-0.646,1.051v0.081l0,0l0,0  l-1.051,1.213l0,0l-0.081,0.081h-0.163l-1.939,0.566h-0.162l-1.859-0.324l-1.051,0.324l-0.243,0.889l0,0l-0.081,0.162l-0.889,0.566  l-0.162,0.081h-0.162l-1.617-0.162l-0.08,0.162v1.617l-0.081,0.081l-0.89,1.132l0,0v0.08h-0.082l-1.535,1.537h-0.082l-0.08,0.081  l-1.617,0.324l-1.051,1.132l0.242,1.374v0.324l-0.242,0.081l-1.213,1.132l-0.647,0.809l0.485,1.051v0.081v0.081v1.536l0,0v0.081  l-0.889,1.293v0.082l-1.213,1.375l0.161,1.617l1.052,0.97v0.082l0,0c0.485,0.808,0.728,1.455,0.728,2.021v1.779h-0.081  l-0.082,0.081l-1.617,1.213l-0.161,2.425l0.161,2.426c0,0.809,0.324,2.345,1.132,4.609v0.081v0.162l-1.778,8.247l0.161,1.617  l1.213,0.566l1.941-1.94l0,0h0.081l6.226-2.426l1.617-1.455l0.162-0.162l0.081,0.081h0.162l3.557,0.324  c0.486,0,1.537-0.404,3.073-1.051v-1.699l0.081-0.08h0.08l0.972-0.89l-0.244-1.051v-0.081V144.8v-0.162l0.081-0.081  c0.324-0.324,0.324-0.647,0.082-0.89c-0.243-0.485-0.163-1.132,0.242-1.86l0.404-0.566l0,0l-0.08-1.132l-1.213-1.455  c-0.566-0.404-0.648-0.971-0.324-1.536c0.162-0.485,0.404-0.97,0.808-1.375l0.324-1.375l0,0l0,0l0.889-1.941l0.244-0.889  l1.293-2.426l-0.889-1.537l-2.507-1.536h-0.162v-0.162l0,0l-0.485-1.294v-0.081v-0.163l0.243-2.183l0,0v-0.081l0.566-1.617  c-0.081-0.566,0-0.971,0.243-1.293c0.162-0.162,0.404-0.324,0.646-0.324l1.537-0.243l0.404-0.889l0.404-2.669l-0.324-0.97  l-1.374-0.323h-0.081l0,0l-1.617-0.809l-0.082-0.081v-0.162l-0.08-0.081l-0.081-1.94v-0.162v-0.243L239.687,109.79z"},{"name":"\u6e56\u5357\u7701","path":"M243.973,195.901l0.081-0.081h-0.162v-0.162l-0.647-1.213l-0.081-0.081v-0.162l0.161-1.941  c0-0.242-0.242-0.485-0.728-0.809h-0.485l-0.809,0.971h-0.081l0,0l-2.021,0.97l-0.324-1.375v-0.162l0.163-0.646l-0.163-0.809  l-0.242-0.08l-0.323,0.646h-0.081v0.081l-2.507,2.184l-0.081,0.162h-0.081h-0.162h-0.162l-0.728-0.324l-0.081-0.081l-0.809-0.728  l-1.293-0.485l0,0l-0.081-0.081l-0.808-0.565l-2.669-0.567l0,0h-0.08l-1.779-0.89v0.082l-1.375-0.646l-1.778-0.162l-0.647,0.08  l0.566,2.992h-0.243l-1.779,0.162h-0.971h-0.081l0,0l-0.971-0.646l-1.616,0.727l-1.456,1.941l-1.293,3.477l0.404,3.8l0.565,2.184  c0.08,0.242,0.08,0.323,0,0.404l-0.242,0.081c-0.404,0.243-0.566,0.809-0.486,1.617l0.809,3.314l-0.241,0.162  c-1.456,0.809-2.184,1.456-2.265,1.779l-0.161,1.133l1.374-0.567l0.081-0.081h0.082c0.97,0,1.535,0.324,1.617,1.132l0.242,1.779  l-0.081,0.243l-0.162,0.162c-0.243,0.243-0.404,0.485-0.404,0.809l-0.243,1.86c0.081,0.646,0.324,1.132,0.647,1.375l1.698,2.021  l1.536-1.213l1.213-0.162h0.081l0.081,0.162l0.809,0.242c0.243,0,0.485-0.08,0.728-0.324l0.728-1.051l-0.162-0.646  c0.162-0.243,0.404-0.404,0.728-0.566h1.941c0.323,0.162,0.565,0.082,0.565-0.081c0.243-0.566,0.484-0.809,0.728-0.97  c0.243,0,0.647,0.081,0.889,0.324c0.566,0.485,0.971,0.889,0.971,1.455l-0.162,1.456l0.324,0.243  c0.484,0.404,0.808,0.808,0.808,1.132l-0.324,1.455c-0.242,0.809-0.484,1.375-0.809,1.537v-0.081l-1.213,2.587l0.404,0.162  l1.941,0.081l0.404,0.162l-0.162,0.324c-0.243,0.809-0.323,1.374-0.243,1.778c0.647,0.405,1.051,0.648,1.293,0.405l1.132-0.485  l0.565-0.243h1.052l1.051-1.132v-1.375c-0.082-0.485,0-0.809,0.162-1.051c0.324-0.243,0.969-0.243,1.941,0.323l1.94,1.213  c0.646,0.485,1.131,0.647,1.455,0.647v-0.081c0.162-0.324,0-0.971-0.404-1.779l-1.05-1.617v-0.162h0.081l0.081-0.162  c1.051-1.456,2.182-1.94,3.477-1.456l2.992,1.375l1.213-0.809h0.081v-0.081v-0.081l-0.161-0.162l0.081-0.081l0.081-0.162  c0.971-1.617,1.293-2.83,0.971-3.477c-0.244-0.566-0.647-0.809-0.971-0.809h-0.242l-0.162-0.809h0.162  c0.566-0.242,0.89-0.485,0.969-0.809l-0.243-0.404l-1.293-1.213l0,0v-0.081l-0.646-1.778c-0.243-1.375-0.404-2.587-0.243-3.719  v-0.809l-0.809,0.728l-0.728,0.809l-0.242-3.396l0,0v-0.162h0.081c1.778-2.588,2.991-4.124,3.396-4.528l-0.809-2.425  c-0.242-1.213-0.404-1.941-0.404-2.264l-1.455-0.647L243.973,195.901z"},{"name":"\u6e56\u5317\u7701","path":"M215.834,165.904l-0.081,0.323l0.404,0.486l2.102,1.455l0,0v0.081h0.081l1.294,1.456  l-0.162,0.161l-0.809,0.97l-0.08,0.082l-0.081,0.161h-1.376l-0.809,0.081l-0.565,0.566l0.243,0.727v0.082l0.081,0.809l0.728,1.051  v0.081v2.264l0.646,0.244l1.133,0.322h0.08l0,0l0.081,0.082l0.081,0.081l1.051,1.455v0.082l0,0l0.566,1.455v0.081l0,0v0.97  c-0.082,0.566-0.243,1.051-0.404,1.375c-0.405,0.566-1.131,1.051-2.264,1.536l-2.75,1.617h-0.081l-5.013,0.324l-0.323,1.213  l0.889,1.617v0.08v0.081l0.243,2.102l2.749,3.234h0.082l0,0v0.082l1.131,1.859l0.082-0.242v-0.082l0.89-2.506l0,0l0.081-0.081l0,0  l1.617-2.102l0.08-0.081l2.021-0.971h0.162l1.295,0.809l1.697-0.162l-0.566-2.83l0.323-0.081l1.537-0.162l1.617,0.08h0.162v0.082  l3.234,1.455l2.749,0.566h0.082l0,0h0.082l0.889,0.646l1.293,0.485v0.082l0,0l0,0l0,0l0.809,0.727l0.485,0.162l0.89-0.809v-0.081  l1.375-1.052l0.728-1.374l1.293,0.727v0.082v0.08l0.324,1.051v0.243l-0.163,0.647l0.082,0.161l0.809-0.404l1.131-1.132h1.052v0.081  h0.081l0.728,0.486c0.485,0.484,0.647,0.889,0.485,1.293l-0.081,1.779l0.485,0.889l0.162,0.082c1.94-2.103,3.234-3.154,4.043-3.154  h2.182l0.485-1.051l1.698-0.809h0.082l2.103-0.162l2.183-1.132v-0.081h1.375l-0.244-0.646l0.082-0.162l0.323-0.324l-2.991-6.387  v-0.162l-0.082-0.081l1.294-1.779l-0.404-0.404l-2.184-0.405h-0.242l0,0v-0.161l-1.375-1.456l0.081-0.324l-0.081,0.082  l-0.081,0.081l-1.213-0.809c-0.565,0.728-1.132,1.213-1.778,1.375c-0.566,0.243-1.456-0.404-2.668-1.859l-0.647-0.809  c-0.081-0.162-0.646,0-1.536,0.323c-1.375,0.486-2.264,0.566-2.668,0.324c-0.404-0.404-0.566-1.213-0.404-2.264  c0.081-0.89,0-1.375-0.162-1.617l-10.511-0.566c-0.971-0.404-1.779-0.809-2.184-1.213l-1.617-0.404  c-0.646-0.242-1.859-1.294-3.477-3.315l-1.051,0.89l-1.617-0.486l-4.366,0.082l0,0l0,0L215.834,165.904z"},{"name":"\u5e7f\u4e1c\u7701","path":"M268.634,236.491c0.728-0.081,1.132-0.404,1.292-0.809v-0.081l0.082-0.243h0.322l1.456-0.081  v-1.051c-0.404,0-0.809-0.162-1.212-0.485l-2.426-2.182v-0.082l-1.052-3.072l-1.455-1.456c-1.779-0.081-3.153-0.081-4.124,0  l-0.324,0.081l0.082,0.97v0.162v0.243h-0.243l-1.292,0.566l-0.244-0.162c-1.05-1.051-1.698-1.456-2.103-1.213  c-2.83,1.375-4.447,2.021-4.931,1.698c-0.325,0.081-0.729,0.404-1.294,0.97l-0.243,0.324l-0.323-0.324  c-0.809-0.727-1.213-1.375-1.213-1.859c0-0.324,0.566-0.97,1.536-2.021c1.133-1.293,1.698-2.021,1.698-2.183l-0.242-0.404  c-0.323-0.162-0.971,0.162-1.779,0.809c-0.809,0.566-1.294,0.809-1.617,0.728c-0.161,0-0.324-0.242-0.404-0.646l-0.082-0.162  l-0.727-1.294l-1.537,0.971l-0.161,0.162l-0.081-0.162h-0.081c-1.132-0.647-2.184-1.051-3.234-1.456  c-0.727-0.243-1.456,0.081-2.184,0.97l0.728,1.213c0.485,1.213,0.729,2.021,0.485,2.588c-0.081,0.242-0.324,0.485-0.646,0.485  c-0.486,0.162-1.213,0-2.103-0.728c-0.727-0.485-1.293-0.889-1.778-1.132l-0.97-0.404v0.081l0,0l0.081,0.162v1.779l-1.294,1.456  v1.375l0.566,1.455l0.081,0.081l-0.889,1.375l-0.566,1.294v0.081l-1.213,1.213l-2.021,4.609l0.082,2.506l-0.082,0.082l-4.366,2.506  l-0.243,0.485l0.566,1.294v0.081v0.081l-0.404,1.698l-1.779-0.243l-0.404,2.184h-2.264l-0.486,0.809l0,0l-0.646,1.374l-0.404,5.095  l0.484,1.051l0.081,0.162v1.051l0.971,1.213l0.081,0.162v0.969l2.587-0.161l0.162-0.244v-0.081h0.081v-0.08l0.728-0.97  l-1.617-1.456l-0.162-0.162l-0.889-0.728l-0.081-0.081l-0.081-0.082v-1.617h1.375l0.161-0.565l-0.565-1.617h3.154l5.579-2.669  l0.727-1.213l0.163-0.404l1.132,0.486h0.081l0.081,0.242l0.485,0.566l0.566-0.082l-0.162-1.213h1.86l1.778,0.324l0.729-1.213  l0.08-0.081v-0.081l0.162-0.081l1.94-0.566l0.324-2.83l2.021,1.779l0.809,0.162l0.404-0.485l-0.242-6.145v-0.163v-0.324  l1.375,0.244h0.081l0.162,0.08l0.081,0.081l2.182,3.962l2.749-0.324l0.485-0.161l0.404-0.971l-0.809-0.646l-0.242-0.324  l1.859-0.646l0.162-0.082l0.081-0.081l0.728,0.809l0.646-0.324v-1.213l0.404-0.081h1.375c0.969,0.081,1.698,0.566,2.263,1.293  l0.163,0.324l0.565-1.941c0.325-0.485,0.97-0.565,1.942-0.161l0.161,0.081v0.08l0.081,0.082c0.082,0.08,0.243,0.162,0.324,0.162  c0.404-0.162,1.86-1.132,4.205-2.992C266.936,237.461,267.582,236.814,268.634,236.491z"},{"name":"\u6c5f\u897f\u7701","path":"M268.957,189.11l-0.082-0.082l-1.779-1.535l-0.969,0.484c-0.647,1.455-1.536,2.346-2.669,2.75  c-0.323,0.161-0.728,0.081-0.97-0.162c-0.323-0.404-0.162-1.294,0.404-2.667l-2.669,1.697l-0.08,0.162h-0.081h-2.345l-2.103,1.051  v0.162l-2.265,0.081l-1.213,0.647l-0.565,1.132l-0.162,0.162h-2.667c-0.486,0-1.536,0.809-3.234,2.506  c0.809,0.324,1.213,0.647,1.375,0.89l0.081,0.485v-0.081l1.213,4.527l0,0l0.08,0.243v0.323h-0.08l-0.161,0.081h-0.081l-3.234,4.447  l0.162,1.132c0.485-0.404,0.889-0.485,1.213-0.323c0.404,0.162,0.565,0.809,0.404,1.779c-0.162,1.537,0.081,3.234,0.809,4.851  l1.132,1.213c0.404,0.404,0.565,0.809,0.484,1.213l-0.565,0.809l0.727,0.97c0.404,0.809,0.082,2.184-0.889,4.124l1.052,1.779  l0.161,0.404l0.648-0.404c1.05-0.97,1.94-1.213,2.667-0.97c0.486,0.162,0.728,0.566,0.809,0.97  c0.082,0.566-0.566,1.537-2.021,2.992l-1.131,1.456l0.565,0.889c0.809-0.728,1.456-0.97,1.86-0.809  c0.485,0,1.859-0.485,4.204-1.698c0.729-0.404,1.699,0,2.911,1.213l0.485-0.243l-0.081-0.97l-0.242-0.162  c-0.163-0.243,0-0.485,0.242-0.728l-0.404-1.537c-0.081-0.243-0.081-0.566,0-0.809c0.244-0.243,0.567-0.404,0.889-0.566  l0.728-0.647l-0.404-0.97v-0.081h0.081v-0.081c0.324-0.485,0.324-0.889,0.243-1.131c-0.323-0.566-0.08-0.97,0.566-1.537l0.89-0.809  l-0.162-0.162l-0.242-0.243l1.051-0.485v-1.294c0-0.485,0.404-1.132,1.536-1.94l0.485-0.404l0,0l-1.213-1.375  c-0.404-0.566-0.242-1.293,0.485-2.021v-0.162l2.507-2.102l0.081-0.566c-0.485-0.162-0.647-1.051-0.404-2.426  c0.323-2.183,1.292-3.234,2.992-3.477l0,0h0.162l1.051,0.566h1.131l1.052-1.294l0,0l0,0l0.082-0.081l1.292-0.808l-0.161-1.132  v-0.242l0.161-0.162l0.325-0.162l0.404-0.484l0.079-0.081l-0.809-1.375c-0.809-1.051-1.535-2.021-2.021-3.154  c-0.404-0.727-0.322-1.535,0.243-2.426l-1.456-0.889L268.957,189.11z"},{"name":"\u798f\u5efa\u7701","path":"M275.586,199.944l-0.161,0.082l-1.374,0.969l-1.213,1.375h-0.082v0.162h-1.778l0,0l-0.97-0.566  c-1.213,0.323-1.86,1.132-2.104,2.668l-0.08,1.375l0.97-0.89l-0.646,2.668v0.08v0.082l-2.669,2.344  c-0.404,0.486-0.565,0.89-0.404,1.132l0.485,0.566c0.566,0.485,0.889,0.889,0.809,1.213c0,0.243-0.081,0.485-0.242,0.647  l-1.699,1.455c0.082,0.404,0.082,1.051,0,1.779v0.242l-0.081,0.082l-0.646,0.242c0,0.404-0.162,0.647-0.566,1.051l-0.89,0.889  v0.082c0.162,0.404,0.162,0.889-0.161,1.617c0.404,0.809,0.404,1.375,0,1.617l-0.809,0.809l-0.162,0.081l-0.404,0.162v0.162  l0.566,1.94h0.161c1.375-0.161,2.83-0.161,4.447,0h0.162v0.081l1.78,1.779v0.081h0.08l1.052,2.992l2.182,2.021l0.891,0.323  l0.081-2.506l2.021,2.021l0.324-0.324l1.456-2.991l0.241-1.698l0.242,0.081h0.162l1.537,0.081l-0.082-1.213v-0.243v-0.162h0.244  l2.021,0.081c1.051-1.051,1.536-1.94,1.536-2.668l-0.323-2.911l1.778,0.566l0.486-0.809l-0.809-0.809l-0.243-0.324l1.617-1.617  l0.082,0.162h0.161l0.97,0.566v-0.243l-0.647-1.456l0.243-0.242l0.404-0.243l-0.161-0.566l-0.809-1.537l0.161-0.081l0.161-0.162  l2.184-1.213l0.081-0.889c-1.86-0.97-2.83-1.778-2.669-2.183c0.082-0.324,0.243-0.404,0.647-0.404l2.426,0.404l0.082-1.455v-0.162  l1.213-1.213l0.322-0.889c-0.485-0.162-0.809-0.485-1.131-0.809l-0.082-0.162v-0.162l0.082-0.404l-0.082-0.162l-0.162-0.081  l-0.082,0.081c-0.161,0.323-0.565,0.566-1.131,0.566c-0.89,0-1.617-0.404-2.182-0.97v-0.081h-0.082l-0.647-1.132l-0.161,0.162  c-0.08,0.485-0.404,0.97-0.97,1.375c-1.051,0.485-2.021,0.647-2.991,0.243c-0.647-0.243-1.052-0.728-1.294-1.456l-0.244-1.617  c-0.242-1.536-0.565-2.425-1.05-2.667c-0.485-0.324-0.971-0.404-1.375-0.324l0.082,1.375L275.586,199.944z"},{"name":"\u6d59\u6c5f\u7701","path":"M288.362,176.819c-0.889,0.404-1.617,0.727-2.183,0.809c-0.486,0-1.294-0.162-2.425-0.566  l-1.86-0.243c-0.565,0.243-1.212,1.051-2.102,2.425l1.213,2.588l-2.021,1.132h-0.081l-1.617-0.485  c0.648,1.213,0.809,1.94,0.566,2.264l-0.162,0.647c-0.404,0.97-0.728,1.536-1.051,1.859l-2.83,2.507l0.728,0.404l-0.484,0.404  c-0.647,0.567-0.809,1.213-0.486,1.698l1.942,2.992h0.079v0.081l0.89,1.617v0.082l0.081,0.081l-0.081,0.162v0.162v0.081  l-0.161,0.162c0.404,0,0.727,0.162,1.131,0.404c0.647,0.404,1.132,1.537,1.374,3.234l0.326,1.617  c0.161,0.404,0.322,0.647,0.727,0.809c0.647,0.324,1.456,0.243,2.182-0.243c0.404-0.242,0.647-0.485,0.567-0.728l-0.081-0.081  v-0.162l1.374-0.97l0.161,0.162l1.052,1.779c0.404,0.323,0.809,0.485,1.456,0.485l0.404-0.081l0,0l-0.323-0.97l1.536,0.647h0.404  h0.081l0.081,0.162l1.456,1.132l0.404-0.647l-0.082-2.749l0.082-0.081l0,0l0.97-1.213c0.082-0.161,0-0.485-0.404-0.889  l-0.244-0.243l0.163-0.162l0.081-0.162l0.243-0.081l2.021-3.315l0.161,0.081l0.404,0.081l0.161,0.082v0.161l-0.161,1.294h0.161  l2.265-2.021l-0.161-1.051h-0.404l-0.809,0.081l1.374-3.719l-1.213-0.163l0,0h-0.161v-0.162l-0.404-0.484  c-0.243-0.486-0.243-0.891,0.08-1.295l1.941-0.08h1.213c0-0.404-0.243-1.132-0.969-2.345l-1.699-0.566l1.778-1.698v-0.404  l-0.888,0.162H295.8v-0.081l-0.079-0.081l-0.082-0.162c-0.243-0.809-0.727-1.456-1.456-1.698l-3.234,0.081l-1.374,1.617v0.081  l-0.404-0.081l-5.095-1.617l4.933-1.294c0.322,0,1.131-0.809,2.507-2.425l-1.698-1.213L288.362,176.819z"},{"name":"\u5b89\u5fbd\u7701","path":"M269.118,162.75h-0.079v-0.081c-0.89-3.072-1.699-4.771-2.265-5.013l-2.83-0.971  c-1.617-0.484-2.75-0.808-3.234-1.131c-0.809-0.485-1.859-1.617-3.072-3.477h-0.486l0.082,0.081  c0.161,0.647,0.809,1.779,2.182,3.396l0.081,0.081l0.081,0.162l-1.293,2.345c-0.486,0.889-0.97,1.293-1.455,1.132  c-0.323-0.162-0.971-0.889-2.021-2.264l-1.375-0.404c0,0.404,0.243,1.213,0.809,2.506v0.082v0.08v0.081v0.081l-0.242,0.889  l-1.456,0.647l0,0l-0.484,0.162c-0.244,0.243-0.244,0.647-0.163,1.132c0.163,1.213,0.082,1.94-0.162,2.264  c-0.161,0.162-0.243,0.162-0.404,0.162h-0.08l0,0l-1.617-0.323c0.08,0.323,0.323,0.646,0.727,0.89  c0.809,0.728,1.455,1.778,2.103,2.991l0.08,0.244l0,0l0.729-0.163c0.889-0.162,1.697,0,2.506,0.566l0.89,1.051l0.081,0.081v0.082  h-0.081l-0.081,2.102c0.243,0.324,0.404,0.728,0.243,1.051c-0.162,0.404-0.486,0.647-1.052,0.728c-0.647,0-0.97,0.404-1.132,1.213  l0,0l0,0v0.081l-0.646,1.375l0.97,0.97l2.103,0.404h0.162l0,0l1.051,1.131l-1.294,1.941l2.992,6.469l0.082,0.162l-0.486,0.566  l0.163,0.484h0.08l5.499-3.477l-0.89,1.617c-0.727,1.213-1.131,2.264-1.293,2.992c0.971-0.404,1.779-1.133,2.265-2.426l0.08-0.162  h0.081l1.536-0.809l0.082-0.162l2.184,1.941l2.425,0.081l0.082,0.08L273,189.19l2.991-2.587c0.243-0.243,0.486-0.728,0.809-1.536  l0.325-0.647c0.079-0.323-0.325-1.132-1.134-2.506l-0.727-1.051l3.556,1.213l1.052-0.566l-1.052-2.264l-0.079-0.081l1.778-2.344  l-0.728-1.132c-0.728-0.809-1.213-1.213-1.536-1.213l-0.162,0.082l-0.89,0.889l-0.161-0.081h-0.162l-1.456-0.486l-0.404-1.293  c-0.565-0.081-1.131-0.404-1.617-0.97l-0.889-0.566c-0.729-0.323-1.133-0.727-1.133-1.131c-0.161-0.486,0-1.052,0.486-1.779  c0.888-1.294,1.374-2.344,1.374-3.153v-1.051l0.565,0.08l1.86,0.082c0.162-0.162,0.404-0.97,0.727-2.426l-0.565-0.081  c-1.294,0.89-2.265,1.456-2.991,1.698c-0.891,0.243-2.021-0.242-3.639-1.375v-0.081L269.118,162.75z"},{"name":"\u5929\u6d25\u5e02","path":"M260.305,108.577l-0.242-0.161c-0.404,0-0.809,0.404-1.213,1.293l-0.244-0.162l-0.08,0.081  l0.08,0.081l-0.727,0.728l-0.324,0.161l-0.889,0.485l-0.081,0.566c0.081,0.89-0.161,1.537-0.565,1.778l-0.323,0.971  c-0.081,0.242-0.163,0.889-0.081,1.778l0.485,2.426c0.161,0.324,0.565,0.728,1.374,1.051l1.86,0.485  c0.484,0,1.132-0.243,1.858-0.728l-0.485-0.889v-0.162v-0.082l0.162-0.727v-0.082l0.89-1.617h1.536l0.404-0.08  c-0.162-0.485-0.647-1.375-1.536-2.507l-0.567-0.809c-0.323-0.647-0.646-1.375-0.727-2.345  C260.709,109.385,260.467,108.9,260.305,108.577z"},{"name":"\u5317\u4eac\u5e02","path":"M252.947,105.504l-0.161,0.242l-0.243-0.081l-1.051-0.162l-0.081,0.485v0.243h-0.242  l-1.699,0.646l-0.081,0.243c-0.242,0.566,0,1.051,0.566,1.698l0.161,0.161l-0.161,0.243c-0.486,0.809-1.212,1.617-2.021,2.183  c-0.323,0.243-0.404,0.485-0.404,0.728l0.565,0.728l0.89,0.324l0.727,0.081c0.97,0,1.617,0.081,1.86,0.485l0.809,0.566  c0.565,0.243,1.051,0.404,1.455,0.404c0.323,0,0.728-0.243,1.052-0.89l0.646-0.728l0.486-1.536l-0.404-1.779l0.646,0.162  l1.052,0.081l0.484-0.323l0.162-0.404l-0.808-2.345l0.242-0.809c0.244-0.485,0.566-0.646,0.89-0.727h0.08l-0.162-0.566l-1.94,0.08  v-0.08l-1.778-1.213c-0.729-0.485-1.456-0.566-2.103-0.404l-0.243,0.161c-0.161,0.323,0,0.647,0.485,0.809  C253.028,104.534,253.19,104.938,252.947,105.504z"},{"name":"\u8fbd\u5b81\u7701","path":"M283.106,84.967l-0.97,1.293c-0.161,0.243-0.243,0.728-0.082,1.537v0.485h-1.939h-0.082l0,0  l-1.374-0.404l-1.052,1.617l-0.161,0.162l-1.294,0.809l-1.132,1.213l0,0l-0.161,0.243l0,0l-2.021,2.345v0.081h-0.082l-1.535,0.809  l-1.213-0.809v-0.081l0,0l0,0l-1.133-1.213l-0.727-0.404l0.565,3.315l0.486,1.778l-1.213,1.132l-1.698,2.506v1.052l-0.08,0.08  h-0.081l-0.404,0.647l0.323,0.565h0.647l2.346,0.647h0.079h0.082v0.081h0.081l0.485,0.485l0.647,0.324l0,0h0.162v0.081  c0.243,0.324,0.404,0.647,0.404,0.971l0.243,0.728l2.506,0.727l0.729-0.161l0.727-0.97l1.942-3.72h0.079v-0.081l0.89-1.213  l0.081-0.081l1.537-0.728l1.052-0.081c0.404-0.647,0.727-0.971,1.131-0.971c0.243,0,0.647,0.162,1.295,0.486l0.161,0.081v0.081  l1.374,2.102v0.081h0.082v0.162l0.161,1.537l-0.082,1.698l0,0l-0.404,1.456l0,0v0.162h-0.079l-1.052,1.293l-0.486,1.051  l0.082,1.779h0.161l0.565-0.243l0.647-0.566l0.161-0.162l0.082-0.162l0.809,0.728v0.081v1.294h-0.082l-0.727,0.323l-0.243,0.324  v0.728l-0.081,0.081l0,0l-0.484,0.889h-0.082l-0.161,0.082l-0.647,0.081l-0.646,0.161l-0.485,0.889l0.081,0.162l2.667-0.323  l0.486-0.404l0.889-2.345l0,0l5.983-6.145H292l1.295-0.647l0.079-0.081v0.081h1.052l1.052-0.242l1.131-0.485l0.809-0.89  l1.294-3.558l0,0V101.3l5.013-5.256v-0.081l-0.322-2.83c-0.243-0.081-0.566-0.243-0.729-0.485l-0.161-0.162v0.081l-0.809,0.081  c-0.404-0.162-0.648-0.323-0.97-0.728l-0.243-0.485v-0.081l-0.081-0.081v-4.366c-0.485-0.162-0.972-0.485-1.537-1.051l-1.052-1.132  l-0.97-1.374c-0.162-0.323-0.162-0.809-0.081-1.536l0.081-0.404l-0.565-0.728l-0.082,0.647l-0.727,1.374h-0.243  c-0.565,0-1.213-0.08-1.697-0.323c-0.485-0.161-0.729-0.565-0.729-1.051v-0.323h-0.404l-1.536,0.404l-1.134-1.132l-0.404-0.081  l-0.404,0.404l0.486,0.809l0.162,0.243l-0.809,1.698h-0.081v0.081h-0.081l-1.456,1.617l-0.081,0.081h-0.163l-2.264,0.243  L283.106,84.967z"},{"name":"\u5409\u6797\u7701","path":"M284.885,60.226l-0.322-1.699l-0.809,0.486h-0.082l-1.939,0.727l-0.082-0.161l-0.322-0.081  v0.89l-0.082,0.08l-0.969,1.456h-0.081v0.081h-0.081l-1.456,1.212h-0.162v0.162l-0.243-0.162c-0.97-0.404-1.617-0.889-1.779-1.293  c-0.161-0.162-0.243-0.162-0.404-0.243l-1.051,0.162l-0.647,0.646l1.699,1.456l1.375,0.565l0.082,0.081h0.079l0.082,0.162v0.081  l0.244,1.617h0.079v2.506l0.326,1.456l0.969,2.264l1.131,1.051l0.891-0.647l0.647-0.809v-0.082h0.079l1.134-1.374l0.97,0.89v0.081  l0,0l0,0v0.081l0.97,1.86l1.213,0.484l0.647,1.941v0.081v0.082l-0.082,1.778v0.081h-0.079l-0.486,1.617l0.891,0.809l0.969-0.485  l0.97-0.971l0.243,0.162l0.809,0.242l0,0l0,0l0.97,0.89l1.051-0.243c0.809-0.243,1.213,0,1.456,0.565v0.728l0.161,0.081  l1.131,0.324l0.486-1.051v-0.404c0-0.324,0.08-0.647,0.322-0.728l0.647,0.081c0.891,0.404,1.295,0.97,1.295,1.617l-0.082,0.565  v0.971l0.891,1.293l1.05,1.132c0.324,0.404,0.728,0.565,1.132,0.728h0.162c0.243,0.162,0.404,0.566,0.404,1.455v3.639  c0.161,0.324,0.404,0.566,0.647,0.647h0.162c0.486-0.243,0.808-0.162,1.212,0.243l0.243,0.162c0.404,0.081,0.727,0.404,0.809,1.051  l0.162,2.021l1.86-3.8c0.564-2.021,1.211-3.234,2.102-3.396c0.727-0.243,1.858,0.162,3.314,0.97l5.255,0.404l0.162-1.132  l-2.427-2.345c-1.13-0.646-1.617-1.132-1.454-1.455l1.858,0.081c1.699,0.566,3.316-0.404,4.851-3.154l0,0h0.083l1.777-1.697  l0.243-3.719v-0.404h0.244h0.16l1.373-0.324h0.244l0.162,0.081v0.082l2.828,2.992l0.81-0.324l0.161-0.485l-1.534-1.456  l-0.244-0.161l-0.162-0.243l2.344-1.374l-0.16-3.396l-0.97,0.162l0,0h-0.081l-1.293-0.647c-0.487-0.08-1.135-0.404-2.104-0.97  c-0.484-0.243-0.808-0.485-0.808-0.809v0.081c0,0.323-0.081,0.485-0.243,0.566c-0.241,0.162-0.566,0.243-1.13,0.243h-0.084  l-0.078-0.081h-0.082l-1.13-0.809l-0.972,0.809c-0.485,0.404-0.809,0.728-0.809,1.051l0.485,1.051  c0.242,0.323,0.242,0.484,0.161,0.728c-0.161,0.243-0.566,0.485-1.131,0.565l-0.486,0.243c-0.566,0.161-1.051,0.081-1.374-0.323  l-0.162-0.243l-2.103-2.183c-0.97-0.324-1.536-0.728-1.778-1.213c-0.162-0.243-0.244-0.485-0.162-0.647  c-0.082-0.728-0.243-1.213-0.403-1.456l-0.405,0.243l-0.082,0.162c0,0.242,0.082,0.485,0.325,0.808l0.079,0.162l0.083,0.081  l-0.083,0.162l-1.13,1.86l-1.86-0.404l-0.404-0.243l0,0v-0.243c0.161-0.323,0.161-0.728,0-1.132l-0.244-0.647l-1.534-1.132  l-0.083-0.081c-0.16,0.242-0.322,0.242-0.483,0.323l-1.456-0.162c-0.486-0.081-0.809-0.161-0.97-0.485  c-0.082-0.162-0.082-0.485,0.079-0.889l0.082-0.243l-0.647-1.132l-2.83,0.162c0.082,0.404,0,0.646-0.162,0.97  c-0.082,0.243-0.404,0.324-0.647,0.324c-0.404,0.162-0.89,0-1.294-0.404v-0.081h-0.081c-0.647-0.728-0.89-1.294-0.89-1.779  l-0.565-0.809l-0.809,0.566c-0.727,0.404-1.213,0.404-1.456,0.081l-0.322-0.081l-0.809,0.081l-2.183,0.728  c-0.486,0.323-0.89,0.404-1.213,0.404h-0.243c-0.809,0-1.295-0.243-1.617-0.566l-1.294-1.051L284.885,60.226z"},{"name":"\u9ed1\u9f99\u6c5f\u7701","path":"M335.177,45.024l-1.211-7.924l0.079-0.161h0.083c0.564-0.89,0.887-1.617,0.727-2.183l-0.322-0.485  c-0.892-0.566-1.295-1.86-1.052-4.043h-0.729c-0.568-0.082-1.213,0.162-1.858,0.566c-0.647,0.485-1.053,1.051-1.134,1.456  c-0.323,0.97-1.374,1.617-3.151,2.183l-0.406,2.506v0.081l-0.081,0.081l-0.889,1.617l-0.081,0.162h-0.081h-0.079l-8.007,1.455  h-0.08h-0.243v-0.161l-2.344-2.507l0.727-0.728l-0.889-1.213l-1.132-0.809l-0.082-0.081h-0.08v-0.081v-0.082l-0.405-2.183  l-2.103,0.162l-0.161-0.162l-1.778-1.051l-6.388-1.132l-5.337-0.243l-0.161,0.162c-0.243,0-0.404-0.082-0.486-0.243l-3.073-6.954  c-0.322-0.566-1.617-2.345-4.204-5.417c-2.426-2.991-3.8-4.608-4.204-4.932l-4.529-4.447l-0.727-0.404l-5.66-0.081h-0.082  l-0.161-0.162c-0.565-0.404-1.374-0.809-2.587-1.051c-1.051-0.404-3.477,0.404-7.278,2.426l-0.161,0.081l0.161,1.132h0.081v0.081  h-0.081v0.162l-0.646,1.294v0.081h-0.082l-0.081,0.889c0,0.728,0.162,1.536,0.404,2.183l0.566,0.404l1.213-0.081l1.051,0.243  l0.404-0.323c0-0.728,0.243-1.293,0.566-1.456h0.809l2.83,0.809l0.647,0.082l-0.891,1.536v1.86c0,0.404,0.729,1.374,2.185,2.749  c0.889,0.646,1.454,0.97,1.94,1.051l0.404-0.081l0.404-0.161l1.374-1.375l1.051-0.646v-0.081l0,0l2.183-0.324l0.647-1.375  l1.939-1.131l1.699,0.97v0.081l0.161,0.081l1.617,2.749l0.647,1.86v0.242l-0.323,2.264l0.646,1.536v0.242l-0.483,1.779v1.617  c0.483,1.456,0.727,2.426,0.727,2.668l-0.162,1.375l0,0v0.081l-0.809,1.132v0.081l0,0l0,0l-0.808,0.97l-0.082,1.779l0.486,1.859  l0,0l0.081,0.081l-0.081,0.081l0,0l-0.486,2.83l-0.404,0.404c-0.322,0.242-0.727,0.242-1.213,0h-0.161l-0.727-0.809l-0.809,0.242  l-1.052,1.132l-1.132,3.315v0.081l-0.081,0.081l-1.132,0.97h-0.163l-0.646,0.081l-1.293,1.86l0.648,1.212l0.161,0.162l1.617,2.021  v0.081v0.646l1.779,0.243l0.323,1.617v0.081l0.242,1.94l0.486,0.404l1.617-0.485l1.535-0.89l0.243-0.161l0.565,2.749l0.729,1.051  l0.161,0.081l0.566,1.132l1.213,0.971c0.161,0.242,0.565,0.242,0.969,0.242l0.404,0.081l0.729-0.323  c0.565-0.243,1.131-0.485,1.778-0.566l0.485-0.242l1.132-0.081c0.404,0,0.565,0.081,0.809,0.323l1.617-1.051h0.161l0.161,0.081  l0.082-0.081l0.162,0.161c0.647,0.728,0.97,1.375,0.97,1.698l0.729,1.213l0.565,0.162h0.081h0.081l-0.162-0.162  c-0.082-0.404-0.082-0.646,0-0.809c0.162-0.242,0.485-0.404,0.97-0.404l2.991-0.081l0.082-0.081h0.161v0.162h0.161l0.891,1.698  l-0.082,0.89h-0.079l1.13,0.242h0.083c-0.083-0.242-0.083-0.404,0.079-0.566l0.404-0.081l2.668,1.859  c0.243,0.243,0.405,0.566,0.487,0.97l0.079,1.132l0.891,0.162l0.565-0.97c-0.244-0.485-0.405-0.971-0.322-1.294  c0.078-0.323,0.16-0.566,0.483-0.728l0.244-0.243c0-0.162,0.081-0.243,0.242-0.324l0.727,0.081  c0.405,0.243,0.729,1.051,0.891,2.426v0.162l0.162,0.081c0.081,0.323,0.565,0.566,1.294,0.809h0.079l0.082,0.081l2.586,2.668l0,0  l1.213-0.404l-0.162-0.404c-0.324-0.404-0.405-0.809-0.405-1.052c0-0.565,0.405-1.131,1.213-1.697l1.375-1.213l1.617,1.132h0.324  l0.323-1.779v-0.323l0.322-0.081l1.295,0.162c0.243,0.242,0.403,0.485,0.403,0.889c0,0.323-0.241,0.728-0.484,1.051l0.243,0.162  c0.808,0.404,1.455,0.728,1.939,0.809h0.081l0,0l1.052,0.566l0.81-0.081l-1.214-5.902c-0.81-0.485-1.536-1.455-2.265-2.588  c-0.565-0.97-0.243-2.345,1.052-3.962c0.726-0.809,1.617-1.616,2.587-2.425l0,0l0.081-0.162h1.132l0.082,0.162l0.97,0.403h2.021  c0.81-0.403,1.536-1.616,2.344-3.557C335.502,51.008,335.502,48.663,335.177,45.024z"},{"name":"\u5c71\u4e1c\u7701","path":"M288.523,125.476l-0.161,0.08c0,0.404-0.244,0.647-0.647,0.647l-3.152-0.323  c-2.183-0.404-3.639-0.729-4.367-1.132l-4.447,4.205l0.163,1.779v0.162l-0.404,0.081c-3.478,0.485-5.337,0.162-5.581-0.971  l-0.404-5.013l-4.042-0.243l-1.697,3.558l-0.163-1.537c-0.081-1.213-0.323-1.94-0.566-2.102l-1.778,0.889l-0.808,1.052  l-0.082,0.081h-0.081l-1.617,0.566c-1.778,1.455-3.315,2.992-4.689,4.608l-4.286,5.821l0.89,2.021v0.324l0,0l-0.081,0.081  c-0.323,0.485-0.161,1.213,0.325,2.021c0.565,1.051,0.969,2.184,0.969,3.477v0.243l-3.476,2.021v0.809l1.617,0.727  c0.161,0.082,0.242,0.243,0.242,0.324v0.162c-0.081,0.404,0.566,0.97,1.779,1.536l2.991,0.809l0.89-0.565l0.971-1.375l0.809-2.345  l2.344,0.89l0.324,0.243v0.162l0,0v0.081c-0.404,0.971-0.161,1.617,0.566,2.021l2.587,0.081c0.89-0.161,1.617-0.485,2.103-0.889  c0.323-0.404,0.809-0.485,1.536-0.404c0.89,0.162,1.699,0.485,2.265,1.213l0.565-1.375l0.163-0.243h0.081  c0.404-0.242,0.647-0.646,0.969-1.213c0.243-0.566,0.647-1.132,1.295-1.537l1.131-0.646l0.082-0.081l0.08,0.081h0.081l0.647,0.162  l0,0l0.161,0.08l0.891-4.042v-0.081l1.292-0.243c1.294-0.89,1.942-1.617,1.86-2.264l-0.244-1.213  c-0.322-0.809-0.322-1.375-0.161-1.617c0.243-0.243,0.404-0.323,0.647-0.323c0.566,0,1.213,0.162,1.86,0.484l0.161-1.293v-0.162  l0.081-0.081l1.375-0.647l0.161-0.728h-0.809l-0.161-0.081l0.079-0.404v-0.243l0.082-0.162h0.243h0.161  c0.565,0,1.213-0.323,1.939-0.97l5.095-3.638h0.161l1.617,0.727l0.648-0.081l-0.404-1.698v-0.162l0.082-0.082l0.079-0.081  l0.891-1.455L292,125.88l-0.565,0.162v0.081h-0.082l-1.617,0.242h-0.404h-0.079v-0.081l-0.082-0.242l-0.322-0.566H288.523z"},{"name":"\u4e0a\u6d77\u5e02","path":"M295.721,173.585l0.565-0.646l0,0l0,0v-0.082l-2.021-1.617c-1.052-0.727-1.94-0.97-2.587-0.889  l-0.89,0.323v1.698c-0.162,0.566-0.404,1.213-0.97,1.698l-0.323,0.324l0.809,0.971h0.081l0.243,0.646l0.97,0.404  c0.565-0.404,0.969-0.566,1.374-0.486l1.699,0.324l0.08-0.566C294.831,174.556,295.235,173.908,295.721,173.585z"},{"name":"\u6c5f\u82cf\u7701","path":"M283.997,155.797c-0.891-0.728-1.617-2.021-2.347-4.043c-2.344,0-3.717-0.404-4.365-1.213  c-0.486-0.728-1.456-1.213-2.83-1.617l-0.404-0.081l0.404-1.375l-0.243-0.162l-0.404-0.081c-0.97,0.485-1.617,0.97-1.86,1.617  c-0.322,0.647-0.727,1.213-1.213,1.617c-0.404,1.293-0.809,1.94-1.213,1.94c-0.241,0.081-0.404-0.081-0.565-0.324l-0.648-0.566  c-0.484-0.242-0.969-0.485-1.374-0.485l-0.809,0.162c-0.566,0.566-1.375,0.97-2.588,1.132l-3.072-0.162  c-0.971-0.485-1.375-1.456-1.132-2.668l-1.133-0.404l-0.565,1.617l0,0v0.081l-0.082,0.081l-0.241,0.323l0.728,0.162h0.161  l0.082,0.081v0.081c1.375,1.86,2.425,3.073,2.992,3.396c0.323,0.162,1.294,0.485,2.991,0.97l2.911,1.051  c0.889,0.404,1.779,2.183,2.749,5.336c1.295,0.89,2.104,1.294,2.669,1.213c0.565-0.242,1.536-0.809,2.912-1.698l0.079-0.081  l0.082-0.081l0.162,0.081l1.456,0.324h0.162v0.242l-0.081,0.243c-0.485,1.941-0.889,3.073-1.213,3.396l-1.94,0.081v0.081  c0,0.809-0.565,2.021-1.617,3.557c-0.322,0.486-0.404,0.89-0.404,1.132l1.86,1.293c0.484,0.566,0.809,0.728,1.213,0.728h0.404  l0.404,1.375l0.889,0.323l0.485-0.485c0.243-0.242,0.565-0.404,0.809-0.324c0.809,0,1.456,0.486,2.264,1.537l0,0l0.727,0.971  l0.082-0.082c0.485-0.323,1.374-0.242,2.669,0.162l2.101,0.484l1.942-0.646l0.809-0.404l0.565-0.404l-0.486-0.566  c-0.161-0.323,0-0.728,0.404-1.132c0.486-0.404,0.809-0.809,0.809-1.294v-0.97c-0.161-0.486-0.079-0.809,0.082-0.971  c0.162-0.324,0.727-0.485,1.375-0.646c1.051-0.162,2.345,0.323,3.881,1.617l-0.565-1.617l-0.891-1.212l-0.161-1.457l-1.374-0.242  h-0.082v-0.081l0,0l0,0l-3.639-2.103l-1.779-0.323v-0.404l-0.082-1.859C285.693,158.626,284.724,156.524,283.997,155.797z"},{"name":"\u6cb3\u5317\u7701","path":"M270.008,106.07l-0.647-0.324l0,0h-0.081l-0.486-0.485l-2.264-0.646h-0.566l-0.404,0.162  l-0.89-1.698l0.081-0.082l0.647-0.809v-0.97l0.08-0.162l0.404-0.647l-0.323-0.162l-1.213-0.243l0,0l-2.103-0.324h-0.161  l-1.213-1.213v-0.081l-0.404-0.809l-0.082-0.242l0.647-1.699v-1.213l-0.08-0.323l-0.648,0.647l-0.081,0.08l-0.161,0.243  l-0.163-0.243l-0.242-0.08l-1.213-0.971l-0.162-0.162v-0.161l-0.242-1.779l-0.566-0.89l-1.213,0.081l-0.728,1.294l-0.081,0.162  l-0.081,0.08l-1.94-0.404l-0.324,1.779v1.779l-0.081,0.081l-1.051,1.617v0.162l-0.162,0.081h-0.081l-1.213,0.081l-1.213,0.97  l-0.161,0.163l0,0h-0.162l-0.082-0.081l-2.264-0.728l-0.323,0.809v0.081l-0.971,1.617c-0.161,0.323-0.404,0.485-0.646,0.565  l-0.971-0.161l-1.293-0.566l-0.243-0.162l-0.081-0.081v-0.081l-0.242-1.94l-0.404-1.455l-0.243-0.404l-0.566,1.131l0,0l0,0  l-0.971,1.293l-0.809,1.86v0.081l0,0v0.081h-0.08l-0.728,1.052c0,0.323-0.242,0.809-0.729,1.536l0.486,1.86l2.425,2.668l0,0  l0.809,1.698v0.162l-0.082,0.162h-0.081l-0.646,0.809l-0.162,0.162l-1.617,0.323l0.163,1.294l1.212,0.647l1.779,0.404l0.485,1.617  l0,0l0,0v0.08v0.082l-0.404,2.749l0,0v0.082l-0.646,1.213v0.242h-0.162l-2.021,0.324v0.809l-0.565,1.778l-0.243,2.021l0.404,1.133  l2.506,1.536l0.082,0.081l1.051,1.779v0.081l0.081,0.081l-0.081,0.081l-1.293,2.83l-0.324,0.809l0,0l-0.809,1.86l-0.324,1.455  l-0.081,0.163v0.081c-0.404,0.323-0.646,0.647-0.809,1.132c-0.08,0.162-0.08,0.324,0.081,0.485l0.082,0.081l0.809,0.889l0,0l0,0  l0.404,0.647l0.162-0.081l0,0l0.08,0.242v0.082v0.242l0,0v0.081l0,0l0,0l0.162,0.485l0.727,0.243l2.912,0.647  c0.97,0,1.859-0.243,2.83-0.647c0.97-0.404,1.859-0.485,2.83-0.324l0.161-0.565l-0.969-2.183l-0.082-0.162h0.082l4.608-6.388  l4.933-4.77h0.08l1.537-0.566l0.809-0.89v-0.081c0.648-0.485,1.213-0.808,1.861-1.051l-0.486-0.404l-1.052-1.051v-0.081h-0.08  l-0.809-0.97l-0.081-0.162v-0.161l0.404-0.485l-1.052,0.242l-2.264-0.565c-0.889-0.404-1.455-0.889-1.617-1.456  c-0.485-1.455-0.646-2.749-0.566-3.88c-0.323,0.404-0.728,0.485-1.132,0.485l-1.698-0.404l-1.132-0.809l-1.374-0.324h-0.647  c-0.404,0-0.89-0.162-1.213-0.485c-0.485-0.324-0.728-0.647-0.809-0.97c-0.161-0.647,0-1.051,0.566-1.456  c0.565-0.404,1.213-1.051,1.778-1.859c-0.565-0.728-0.809-1.456-0.565-2.184l0.081-0.081c0.08-0.404,0.728-0.728,1.94-1.132  c0.082-0.404,0.242-0.646,0.404-0.728l1.213,0.082l-0.162-0.162c-0.809-0.485-1.051-1.052-0.646-1.698l0.646-0.485  c0.728-0.243,1.617-0.163,2.506,0.323l1.86,1.294h1.698l0.566,0.485l0.161,0.647c0,0.404-0.243,0.646-0.565,0.646  c-0.404,0-0.566,0.404-0.648,0.889l0.809,1.941c0.486-0.728,0.97-1.132,1.457-1.213c0.242,0,0.565,0.162,0.808,0.485  c0.242,0.404,0.486,1.132,0.646,1.86c0.081,0.89,0.323,1.617,0.566,2.021l0.646,0.89c0.971,1.213,1.536,2.102,1.698,2.83  l3.154-0.405l1.375-0.728l1.294-1.617l0.565-1.536v-0.081v-0.081l0.404-1.617v-0.081l0.081-0.162h0.08l1.213-0.809l0.243-0.162  l-0.082-0.081l-2.021-0.647h-0.161v-0.081l-0.404-1.213L270.008,106.07z"},{"name":"\u6cb3\u5357\u7701","path":"M229.337,151.673h-0.082l-6.145,2.506l-1.859,1.779c-0.323,2.749,0,4.366,0.97,4.852  l1.778,1.132h0.082v0.081l0.485,2.991c1.536,2.021,2.587,3.074,3.153,3.315l1.779,0.405l0.242,0.08v0.082  c0.242,0.323,0.809,0.646,1.859,0.97l4.852,0.244c3.558,0,5.579,0.242,5.983,0.646c0.404,0.323,0.485,1.132,0.404,2.345  c-0.081,0.809,0,1.294,0.081,1.375l1.779-0.404c1.375-0.485,2.183-0.485,2.587-0.081l0.647,0.809  c0.969,1.213,1.617,1.697,1.778,1.617c0.485-0.162,1.052-0.646,1.617-1.455l0.162-0.243l1.456,0.89l0.89-0.728  c0.243-1.131,0.809-1.698,1.779-1.779l0.404-0.161l-0.162-0.324l-0.161-0.162l0.08-0.081l0.081-2.021  c-0.646-0.97-1.455-1.294-2.345-1.132c-0.889,0.243-1.536,0.243-1.779-0.081c-0.161-0.242-0.161-0.404-0.161-0.728  c-0.566-0.97-1.131-1.779-1.86-2.506c-0.969-0.809-1.213-1.536-0.969-2.264l0.161-0.243l2.265,0.404l-0.162-1.374  c-0.081-0.809,0-1.375,0.404-1.779c0.162-0.324,0.566-0.485,0.971-0.566l0.97-0.324v-0.404c-0.728-1.536-0.97-2.668-0.647-3.153  l0.486-0.404c0.242-0.081,1.051,0.081,2.183,0.484l0,0l0.081,0.082v0.162c0.889,1.051,1.375,1.698,1.617,1.86l1.536-2.507  c-1.374-1.698-2.101-2.911-2.344-3.396l-1.213,0.808l-0.161-0.162l-3.234-0.809h-0.082v-0.081  c-1.375-0.646-2.184-1.374-2.265-2.102l-1.94-0.889v-1.86l3.557-2.102c-0.161-0.97-0.404-1.941-0.809-2.75l-0.565-1.132  l-2.426,0.243c-1.132,0.485-2.184,0.728-3.234,0.728l-2.507-0.566v-0.89l-0.404-0.081l-0.727-0.243l-0.162-0.485l0,0v-0.081l0,0  l0,0l-0.08-0.242v-0.082v-0.242l-0.162,0.081l-0.162,2.102l-0.08,0.728c-0.162,0.404-0.324,0.647-0.162,0.809  c0.404,0.566,0.322,1.213-0.082,1.779l0.324,1.375l-0.08,0.081l-0.162,0.081l-0.971,0.889v1.86l-0.242,0.081  c-1.779,0.809-2.992,1.213-3.72,1.213l-3.557-0.242l-1.536,1.375H229.337z"},{"name":"\u53f0\u6e7e\u7701","path":"M299.521,218.541c-2.586,1.859-4.447,4.205-5.66,7.035c-1.052,2.426-1.86,3.639-2.426,3.962  l0.565,4.447v0.081l0,0l-0.404,3.073c-0.162,0.97,0,1.617,0.243,1.779l3.314,2.184l0,0h0.081l0.082,0.242l0,0  c0.161,0.728,0.646,1.375,1.292,2.183c0.325,0.485,0.729,0.728,1.052,0.89l0.486-5.336v-0.162l2.344-5.66l0.809-6.711v-0.081  l0.082-0.081l0.727-1.779l-0.566-1.536v-0.081h-0.082l-0.161-2.102l0.082-0.082l0.079-0.081l0.404-0.484l0.244-0.566  L299.521,218.541z"},{"name":"\u6d77\u5357\u7701","path":"M219.877,265.841l-0.243,0.404v0.081l-0.081,0.161l-3.314,0.809l0.162,0.404l1.05,1.213  c-0.08,0-0.242,0.081-0.324,0.081l-1.535,0.809l-2.426,1.86c-0.809,0.97-0.647,2.75,0.566,5.417l2.426,0.242h0.081v0.081  l2.425,1.132l2.588-0.404c1.051-0.242,2.264-1.213,3.8-3.073h0.081l0.162-0.162l1.131-0.324l-0.322-3.395v-0.162l1.455-2.103  v-0.081h0.08l1.132-0.889c0.162-0.971,0.081-1.86-0.324-2.588c-0.322-0.646-0.727-0.89-1.131-0.89l0.162,1.213l-2.183-0.404  l-0.971,0.566h-0.081l0,0H219.877z"}]


}

//地区
var Maparea = function(map, config){
	this.map 		= arguments[0];
	this.config 	= arguments[1];
	this.name 		= this.config.name;
	if(!this.map){ return; }

	this.init();
}
Maparea.prototype = {
	init: function(){
		this.gp = this.draw();
	},

	bind: function(){
		var _this = this;
		return this;
	},

	draw: function(){
		var pa = this.config.path;	
		var co = this.config.color;
		var sk = this.config.stroke; 
		return this.map.paper.path(pa).attr({
			'fill'			: co,
			'stroke'		: '',
			'stroke-width'	: 0
		});
	},

	fade: function(){
		var color = Raphael.color(this.config.color);
		color = Raphael.hsl(color.h, color.s, color.l/1.2);
		this.gp.stop()
		.attr({'stroke': '#fff'})
		.animate(
			{
				'fill'			: color,
				'stroke-width'	: 2,
				'stroke'		: '#ffff00'
			},
			300,
			'easeIn'
		);
		return this;
	},
	
	renew: function(){
		var _this = this;
		this.gp.stop().animate(
			{
				'fill'			: this.config.color,
				'stroke-width'	: 0,
				'stroke'		: '#fff'
			},
			300,
			'easeOut',
			function(){
				_this.gp.attr({'stroke': ''});
			}
		);
		return this;	
	},

	destroy: function(){
		this.gp.remove();
		for(var i=0, len = this.map.areas.length; i<len; i++){
			var area = this.map.areas[i];
			if(area == this){
				this.map.areas.splice(i, 1);
				return true;
			}	
		}
		return false;	
	},

	fillColor: function(color){
		this.config.color = color;
		this.gp.attr({
			'fill'			: color
		});
		return this;
	}
}

var convertAreaName = function(name){
	if(name == '广西壮族自治区'){ return '广西'; }
	if(name == '内蒙古自治区'){ return '内蒙古'; }
	if(name == '宁夏回族自治区'){ return '宁夏'; }
	if(name == '新疆维吾尔自治区'){ return '新疆'; }
	if(name == '西藏自治区'){ return '西藏'; }
	
	name = name.replace('省', '');
	name = name.replace('市', '');
	return name;	
}


var mergeConfig = function(target, source, deep){
	target = target || {};
	var sType = typeof source, i = 1, options;
	if( sType === 'undefined' || sType === 'boolean' ) {
		deep = sType === 'boolean' ? source : false;
		source = target;
		target = this;
	}
	if( typeof source !== 'object' && Object.prototype.toString.call(source) !== '[object Function]' )
		source = {};
		while(i <= 2) {
			options = i === 1 ? target : source;
			if( options != null ) {
				for( var name in options ) {
				var src = target[name], copy = options[name];
				if(target === copy){ continue; }
				if(deep && copy && typeof copy === 'object' && !copy.nodeType){
				target[name] = this.extend(src ||(copy.length != null ? [] : {}), copy, deep);}
				else if(copy !== undefined)
				target[name] = copy;
			}
		}
		i++;
	}
	return target; 
}


})();